[
    {
        "title": "Conference registration (Wednesday)",
        "type": "Special Event",
        "description": "Registration will be located on the 3rd floor Skybridge of the Hyatt Regency Jacksonville Riverfront.",
        "speakers": "TBA",
        "date": "2017-03-01",
        "time_start": "13:00",
        "time_end": "17:00",
        "length_in_hours": 4.0,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/2999",
        "event_url": "https://ire.org/events-and-training/event/2702/2999/"
    },
    {
        "title": "Conference sales (Wednesday)",
        "type": "Special Event",
        "description": "Stop by the NICAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the NICAR T-shirt contest.",
        "speakers": "TBA",
        "date": "2017-03-01",
        "time_start": "13:00",
        "time_end": "17:00",
        "length_in_hours": 4.0,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3003",
        "event_url": "https://ire.org/events-and-training/event/2702/3003/"
    },
    {
        "title": "Techraking <=19: Bootstrapping the News (Sponsored by Reveal from The Center for Investigative Reporting)",
        "type": "Outside Event",
        "description": "Register now!\n\nGive us four hours and your laptop, and we’ll send you into NICAR with a fully-functioning data-crunching machine and the knowledge to use it.\n\nOne of the biggest hurdles to learning programming is the often bewildering process of setting up your computer. Veteran programmers and data crunchers from Reveal from The Center for Investigative Reporting will give you a virtual playground on your personal laptop that will allow you to explore all the tools you'll gather throughout the conference. In this four-hour workshop, we’ll introduce crucial programming concepts and tools and -- most importantly -- why we use them.\n\nYou’ll walk into conference sessions with a laptop loaded with many of the tools presenters will be talking about, and a leg up as you continue developing your skills once you're back home.\n\nTarget audience: People with no or minimal exposure to programming who need a jumping off point to get their feet wet so they are prepared for programming classes at the conference.\n\nRequirements to attend: Laptop with administrative privileges\n\nMinimum technical specifications: Windows: Version 7 or higher; Mac: OS 10.9 (Mavericks) or higher. 4 GB of RAM, 15 GB of free hard-drive space. English layout keyboard strongly preferred. (Other layouts may work, but we've had trouble with certain characters in the past and our ability to provide tech support will be limited.)\n\nParticipants will walk away with a fully functioning dev machine (on their personal laptop) that includes: VirtualBox, Ubuntu/Xbuntu, Bower, csvkit, Django, Fabric, Git, Grunt, Ilene, MySQL, Node.js, NPM, PostgreSQL, PostGIS, PANDAS, Python, QuantumGIS, R, RBENV, Rails, Ruby, SQLite, Tabula, virtualenv/virtualenvwrapper\n\nAdditional details including the schedule for the workshop can be found on the conference website.\n\n*Basic Schedule:*\n\n*1-5 p.m.*\n\nI. Programming: Why should you care?\n\nII. What we're about to install\n\nIII. Installing VirtualBox and Ubuntu\n\nIV. Brief overview of stuff you got with your install\n\nV. Using your new powers\n\nA. Navigating the command line\n\nB. Updating/installing software with apt\n\nC. Working with open-source software\n\nD. Basic version control (git)\n\nE. How to get help\n\n5 p.m. Beer/mingling (Location: Fionn MacCool's)\n\nRegister for this workshop.",
        "speakers": "Michael Corey, Eric Sagara, Scott Pham, Emmanuel Martinez",
        "date": "2017-03-01",
        "time_start": "13:00",
        "time_end": "17:00",
        "length_in_hours": 4.0,
        "room": "River Terrace 3",
        "event_id": "2702/2897",
        "event_url": "https://ire.org/events-and-training/event/2702/2897/"
    },
    {
        "title": "Gentrification clues: Datasets that predict urban upheaval (Sponsored by Donald W. Reynolds National Center for Business Journalism)",
        "type": "Outside Event",
        "description": "Free pre-conference workshop on Wednesday, March 1 from 2-5 p.m.\n\nEvan Wyloge, senior reporter at AZCIR (the Arizona Center for Investigative Reporting) has spent a decade focusing on accountability and watchdog reporting, with an emphasis on data analysis. In this workshop, he will identify disparate datasets that allow reporters to analyze the evolving economic landscape of metro areas.\n\nPopulation density, incomes and property values, the overall volume of economic activity, and racial and ethnic diversity are all clues that can help reporters understand the dynamic shift toward a more urbanized population. Wyloge will show you how to navigate surprising databases and mine the key points to develop insightful stories on the future of your community.\n\nThis pre-conference workshop is produced by the Donald W. Reynolds National Center for Business Journalism.",
        "speakers": "Evan Wyloge",
        "date": "2017-03-01",
        "time_start": "14:00",
        "time_end": "17:00",
        "length_in_hours": 3.0,
        "room": "River Terrace 2",
        "event_id": "2702/2898",
        "event_url": "https://ire.org/events-and-training/event/2702/2898/"
    },
    {
        "title": "International meet and greet *invitation only",
        "type": "Special Event",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-02",
        "time_start": "07:30",
        "time_end": "08:15",
        "length_in_hours": 0.75,
        "room": "River Terrace 2",
        "event_id": "2702/3147",
        "event_url": "https://ire.org/events-and-training/event/2702/3147/"
    },
    {
        "title": "Conference registration (Thursday)",
        "type": "Special Event",
        "description": "Registration will be located on the 3rd floor Skybridge of the Hyatt Regency Jacksonville Riverfront.",
        "speakers": "TBA",
        "date": "2017-03-02",
        "time_start": "07:30",
        "time_end": "18:00",
        "length_in_hours": 10.5,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3000",
        "event_url": "https://ire.org/events-and-training/event/2702/3000/"
    },
    {
        "title": "Conference sales (Thursday)",
        "type": "Special Event",
        "description": "Stop by the NICAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the NICAR T-shirt contest.",
        "speakers": "TBA",
        "date": "2017-03-02",
        "time_start": "07:30",
        "time_end": "18:00",
        "length_in_hours": 10.5,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3004",
        "event_url": "https://ire.org/events-and-training/event/2702/3004/"
    },
    {
        "title": "Welcome and overview of the conference",
        "type": "Panel",
        "description": "Welcome to the conference! IRE staff will highlight key sessions and events that you won't want to miss while in Jacksonville. We'll also give you a brief rundown on some of the resources IRE has to offer.\n\n**Speakers are IRE/NICAR Staff",
        "speakers": "TBA",
        "date": "2017-03-02",
        "time_start": "08:30",
        "time_end": "08:50",
        "length_in_hours": 0.333,
        "room": "Conference Center B",
        "event_id": "2702/2896",
        "event_url": "https://ire.org/events-and-training/event/2702/2896/"
    },
    {
        "title": "Algorithmic accountability",
        "type": "Panel",
        "description": "**Moderated by Greg Linch, McClatchy",
        "speakers": "Julia Angwin, Nick Diakopoulos, Sam Corbett-Davies, Greg Linch",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3032",
        "event_url": "https://ire.org/events-and-training/event/2702/3032/"
    },
    {
        "title": "Carto maps",
        "type": "Hands-on",
        "description": "If you’re looking for an interactive mapping tool that doesn’t require coding, Carto, formerly known as CartoDB, is a great option. We’ll explore the user interface of this web-based tool, walk through examples of both point and polygon maps, and touch base on some presentation-polishing pro-tips.",
        "speakers": "CJ Sinner",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3058",
        "event_url": "https://ire.org/events-and-training/event/2702/3058/"
    },
    {
        "title": "Conversations: Journalism's bottom line (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "This conversation will brainstorm coping strategies and solutions for working in corporate news and the roadblocks that come with it. How do we deal with the push to focus on \"click bait\" material, or doing just about anything to get more web traffic? The focus on boosting web traffic eats up time that could be spent on other important coverage and seems to at times detract from the mission. In newsrooms across the country, money has become so tight that it rules everything that we do. It shouldn't, but it does affect coverage. What's the point of boosting web traffic if we aren't really fulfilling the real purpose of journalism, which is watchdogging and being the fourth estate? This conversation will allow journalists who struggle with these issues to connect and think of creative ways to deal.",
        "speakers": "Janelle O'Dea",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2974",
        "event_url": "https://ire.org/events-and-training/event/2702/2974/"
    },
    {
        "title": "Excel for business & economics",
        "type": "Hands-on",
        "description": "Whether you just started using Excel or it's been your companion for years, chances are there's a lot it can do that you've never realized. We sometimes think of Excel as the stepping stone to database managers like Access or SQL Server, and overlook just how powerful its tools can be -- especially if you're covering business and economics. Come find out why Excel is still so popular in the business world and we'll unlock some of its secrets. The people you're covering know these tricks - you should too.\n\nThis session is good for: People who understand Excel basics but want to unlock powerful functions for analyzing businesses.",
        "speakers": "Aaron Kessler",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2931",
        "event_url": "https://ire.org/events-and-training/event/2702/2931/"
    },
    {
        "title": "Google Earth",
        "type": "Hands-on",
        "description": "Find out how to make simple flyovers with Google Earth – a great way to make bespoke video content that you can weave into your visual journalism storytelling. This session should be fine for anyone, though some experience using Google Earth may come in handy.",
        "speakers": "Nassos Stylianou, Ed Lowther",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3059",
        "event_url": "https://ire.org/events-and-training/event/2702/3059/"
    },
    {
        "title": "Intro to commandline (PC)",
        "type": "Hands-on",
        "description": "If you’ve never touched the little black box on your computer known as the command line, you’re ignoring an extremely helpful tool. In this session, you'll learn how to make the command line work for you and make it become a handy tool in your data toolbelt.\n\nThis session is good for: Newbies to the command line who are brave enough to dive into the guts of their computer. This is geared toward Windows, but much of it translates to Macs.",
        "speakers": "Mike Stucka",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/3060",
        "event_url": "https://ire.org/events-and-training/event/2702/3060/"
    },
    {
        "title": "Security tools for journalists",
        "type": "Demo",
        "description": "You're traveling abroad to cover a story: What steps can you take to secure your data, your devices, and your sources before heading to the airport? What are the pros and cons of bringing a burner into the field? How should you send notes to your editor before returning home? This demo is designed to address the digital security needs of journalists as they travel overseas. Participants can expect to learn a number of software solutions and security practices — with particular focus paid to mobile and desktop security and file encryption.",
        "speakers": "Olivia Martin, Mike Tigas",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2965",
        "event_url": "https://ire.org/events-and-training/event/2702/2965/"
    },
    {
        "title": "What the hell is R? And all the other questions you’re afraid to ask",
        "type": "Panel",
        "description": "",
        "speakers": "Tisha Thompson, Sisi Wei",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3090",
        "event_url": "https://ire.org/events-and-training/event/2702/3090/"
    },
    {
        "title": "Working together without sitting together: Building happy, productive distributed teams",
        "type": "Panel",
        "description": "How do you communicate when you or other members of your team are in different cities? Email, phones and Slack are great tools. But how do you stay abreast of progress and ideas without the casual connections and serendipity that happen when you share the same space? In this panel, we’ll talk about our experiences working remotely and the tools, processes and team-building techniques that help make it work.",
        "speakers": "Ryan Pitts, Julia Smith, Chris Canipe",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3109",
        "event_url": "https://ire.org/events-and-training/event/2702/3109/"
    },
    {
        "title": "Year in CAR",
        "type": "Panel",
        "description": "What were the big stories of the year? What were the most creative uses of data analysis? See what your colleagues have been up to and pick up some story ideas at the same time. This session is good for: Anyone.",
        "speakers": "Lauren Grandestaff, Kaitlin Washburn",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/2899",
        "event_url": "https://ire.org/events-and-training/event/2702/2899/"
    },
    {
        "title": "Interactive data graphics in Tableau Public (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Learn how to create beautiful, interactive data visualizations on short deadlines. No programming required. You'll learn everything you need to build data visualizations and publish them to your website just like a video. We'll teach you how to:\n\n*Connect to Excel files and other data\n\n*Create maps and charts\n\n*Make them interactive\n\n*Publish them on your site\n\nTableau Public is a free tool for journalists. No previous experience with Tableau is necessary to take this class. Laptops will be provided. This is a free training, however you must be registered for the CAR Conference to attend this class.  Limited seats are available. There may be a few seats available on-site.\n\nRegister for this class.",
        "speakers": "Ben Jones",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "10:30",
        "length_in_hours": 1.5,
        "room": "City Terrace 4",
        "event_id": "2702/3015",
        "event_url": "https://ire.org/events-and-training/event/2702/3015/"
    },
    {
        "title": "PyCAR (beginner) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "This hands-on workshop will teach journalists basic programming concepts using the Python language. The daylong class will introduce language basics and useful libraries in the course of a typical reporting project: scraping data from the web, inserting it in a database and analyzing the results.\n\nAlthough the class is geared toward beginners, we'll assume that you're comfortable with databases and SQL and that you've hopefully seen a command line since the days of DOS.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: Attendees should have familiarity with the command line and are comfortable with databases and SQL.\n\nWorkshop times are Thursday 9 a.m. - 12:30 p.m. continuing Friday morning from 9 a.m. - 12:30 p.m. (Note: Registration for this session reserves your seat for both days of this workshop.  Attendees are expected to attend both session to complete this workshop).\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "Adriana Homolova, Tom Meagher, Roberto Rocha, Eric Sagara, Elaine Wong, Heather Battaglia, Chris Keller",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "City Terrace 5",
        "event_id": "2702/2878",
        "event_url": "https://ire.org/events-and-training/event/2702/2878/"
    },
    {
        "title": "Map camp: QGIS (intermediate) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Learn how to uncover interesting news stories by mapping data with geographic information system (GIS) software during our intensive mini-boot camp.\n\nIRE and NICAR trainers conduct this hands-on training using the latest version of QGIS, open source-software that runs on all platforms. We will look at noteworthy stories that have used mapping and show you how to uncover stories using census and other data. You’ll learn how to display data geographically; import and query data; geocode to merge databases with addresses into maps. In addition, we'll provide you with our boot camp materials to help keep you on track long after you leave the conference.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: Participants should have basic knowledge in using relational database programs such as Microsoft Access, MySQL or SQLite.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "David Herzog, Jennifer LaFleur",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "City Terrace 9",
        "event_id": "2702/2883",
        "event_url": "https://ire.org/events-and-training/event/2702/2883/"
    },
    {
        "title": "Programming for humans, in Python (intermediate/advanced) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "You’ve written a few Python scripts that get the job done, but the initial euphoria has worn off. Your code is hard to understand. Bugs are cropping up. Worse, you can’t always explain your process or results to an editor — or yourself. There must be a better way, but the path forward is not clear. If you’ve had that itchy feeling, this full-day, hands-on workshop is for you. After mastering the basics of writing code, you need to understand how to design programs. To that end, this class will explore Python language features that will help you write readable, reliable and reusable code.\n\nPreregistration is required and seating is limited.\n\n**Attendees must bring a laptop and charger to the training.\n\nWorkshop prerequisites: Experience with basic Python language features like variables, data types, conditionals and functions are required.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "Jeremy Bowers, Serdar Tumgoren",
        "date": "2017-03-02",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "City Terrace 7",
        "event_id": "2702/2880",
        "event_url": "https://ire.org/events-and-training/event/2702/2880/"
    },
    {
        "title": "Basic stats in R (advanced)",
        "type": "Hands-on",
        "description": "Learn how to analyze data through methods grounded in statistical theory. Those familiar with R will be introduced to significance tests, risk ratios, various distributions and more.",
        "speakers": "Olga Pierce",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2932",
        "event_url": "https://ire.org/events-and-training/event/2702/2932/"
    },
    {
        "title": "Conversations: NICAR freelancers (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "Freelance journalists and programmers, let's put our heads together! We'll have an informal chat about the joys and tribulations of being self-employed in the world of cutting-edge journalism. Hopefully, we'll trade some new tips and make some new friends. If you're thinking about going freelance, this may be a good session for you, too!",
        "speakers": "Samantha Sunne",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2975",
        "event_url": "https://ire.org/events-and-training/event/2702/2975/"
    },
    {
        "title": "Educator huddle: Let's discuss the future",
        "type": "Panel",
        "description": "Come participate in a session to come up with an ideal data journalism curriculum across universities and programs. This will go beyond a panel session and focus on concrete ideas and proposals that you can take back and begin to put into place. We will use the wisdom of educators and journalists in the room to lay out best practices and the route to them.",
        "speakers": "Cheryl Phillips, Brant Houston",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3045",
        "event_url": "https://ire.org/events-and-training/event/2702/3045/"
    },
    {
        "title": "GitHub for journos",
        "type": "Hands-on",
        "description": "What is Git? What is GitHub? Why should I care? In this session, we’ll answer these questions and tap into why developers think GitHub is the best collaboration platform in the world. You'll learn how to navigate your way around GitHub.com and use it to find incredible projects.",
        "speakers": "Hector Alfaro",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3061",
        "event_url": "https://ire.org/events-and-training/event/2702/3061/"
    },
    {
        "title": "Good things come to those who weight: Conduct more reliable surveys using Veracio",
        "type": "Demo",
        "description": "Most surveys consist of informal, crowd-sourced data. While this data is valuable, it’s often mathematically flawed when demographic and socioeconomic factors are not considered. Our survey tool Veracio automatically weights your responses based on census demographics to produce more accurate data. Join us for our session to learn more about the importance of weighting, how weighting works in Veracio, and how to use the tool to inform your reporting.",
        "speakers": "Heather Krause, Neal Rothleder",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2901",
        "event_url": "https://ire.org/events-and-training/event/2702/2901/"
    },
    {
        "title": "Investigating hacking and data breaches",
        "type": "Panel",
        "description": "**Moderated by Chase Davis, The New York Times",
        "speakers": "Julia Angwin, Joe Sullivan, Chase Davis, Sri Sridharan",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3033",
        "event_url": "https://ire.org/events-and-training/event/2702/3033/"
    },
    {
        "title": "Packaging data stories for digital",
        "type": "Panel",
        "description": "**Moderated by Sarah Hutchins, IRE/NICAR",
        "speakers": "Ashlyn Still, Richard Watkins, Brittany Mayes, Sarah Hutchins",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3046",
        "event_url": "https://ire.org/events-and-training/event/2702/3046/"
    },
    {
        "title": "Practical data viz in JavaScript",
        "type": "Hands-on",
        "description": "Learn how to use JavaScript, HTML, and CSS to build practical visualizations for your data. We'll cover how to make some essential chart/visualization types and go over data visualization best practices.",
        "speakers": "Maureen Linke",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3081",
        "event_url": "https://ire.org/events-and-training/event/2702/3081/"
    },
    {
        "title": "Sports data: How to play money ball",
        "type": "Panel",
        "description": "",
        "speakers": "Steve Doig, Paula Lavigne, John Templon",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3019",
        "event_url": "https://ire.org/events-and-training/event/2702/3019/"
    },
    {
        "title": "Useful Excel functions for journalists",
        "type": "Hands-on",
        "description": "Much of Excel power comes in the form of functions. In this session, you will learn about commonly used functions, including how to use them to analyze data with the eye of a journalist. We will see functions as if and his relatives sumif, countif, sumifs, and more. Also we will see some other useful functions to arrange and clean data like trim, concatenate and vlookup.\n\nThis session is good for: Journalists who want to dig deeper into Excel functions. (Journalists who want to see a little more Excel)",
        "speakers": "Juan Lyon",
        "date": "2017-03-02",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2933",
        "event_url": "https://ire.org/events-and-training/event/2702/2933/"
    },
    {
        "title": "Show where the story is happening with maps in Tableau Public (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Maps are where it’s at, and with the addition of spatial file support you can viz outside the box too. In this session you will learn different methods for building maps in Tableau Public. We will teach you how to:\n\n*determine what kind of mapping data you’re looking at\n\n*take advantage of spatial file support in Tableau Public\n\n*beautify maps with built-in and Mapbox-supported backgrounds\n\n*integrate maps into your dashboards\n\n*utilize design and layout best practices to make sure that your visualization looks polished and professional\n\nTableau Public is a free tool for journalists. Some familiarity with the product is recommended; a beginner session earlier in the day should prepare you enough for this session. Laptops will be provided. This is a free training, however you must be registered for the CAR Conference to attend this class.  Limited seats are available. There may be a few seats available on-site.\n\nRegister for this class.",
        "speakers": "Jenny Richards",
        "date": "2017-03-02",
        "time_start": "11:00",
        "time_end": "12:30",
        "length_in_hours": 1.5,
        "room": "City Terrace 4",
        "event_id": "2702/3016",
        "event_url": "https://ire.org/events-and-training/event/2702/3016/"
    },
    {
        "title": "Advanced stats in R: Linear and logistic regression (advanced)",
        "type": "Hands-on",
        "description": "Continue learning statistical analysis methods in R with lessons in linear regression and logistic regression analyses.",
        "speakers": "Olga Pierce",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2934",
        "event_url": "https://ire.org/events-and-training/event/2702/2934/"
    },
    {
        "title": "Agate for data analysis in Python",
        "type": "Hands-on",
        "description": "In this hands-on session we'll introduce you to programmatic data analysis with the agate module for Python. We'll go through the basics—reading CSV files, transforming data, and running basic statistical analysis—while leaving plenty of room for your questions. This session is ideal for folks with some Python experience, especially those who've reached the limits of what they can do with tools like csvkit, but find pandas and numpy bewildering.",
        "speakers": "Christopher Groskopf, Neil Bedi",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3062",
        "event_url": "https://ire.org/events-and-training/event/2702/3062/"
    },
    {
        "title": "Better than average: Working with high-dimensional data",
        "type": "Panel",
        "description": "",
        "speakers": "Holly Hacker, Paul Overberg, Larry Fenn",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3034",
        "event_url": "https://ire.org/events-and-training/event/2702/3034/"
    },
    {
        "title": "Conversations: Remote working for journalists (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "Remote working in journalism is sometimes very different than remote working in other fields. Even major national media outlets hesitate to allow remote workers for various reasons. I would love to have a conversation about whys why-nots, dos and don'ts of remote working.",
        "speakers": "Kavya Sukumar",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2976",
        "event_url": "https://ire.org/events-and-training/event/2702/2976/"
    },
    {
        "title": "Extracting data from PDFs",
        "type": "Hands-on",
        "description": "Learn how to use tools for extracting text from documents. The seminar will discuss the fundamentals of knowing the best tool for the job, a walk-through using online web applications, and an introduction to cracking tough cases using Optical Character Recognition (OCR). For questions before or after the course, please email Acton Gorton (actongorton@gmail.com).",
        "speakers": "Acton Gorton",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/2935",
        "event_url": "https://ire.org/events-and-training/event/2702/2935/"
    },
    {
        "title": "Finding narratives in the numbers",
        "type": "Panel",
        "description": "",
        "speakers": "Reade Levinson, Shawn McIntosh, Ziva Branstetter",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3114",
        "event_url": "https://ire.org/events-and-training/event/2702/3114/"
    },
    {
        "title": "OpenRefine",
        "type": "Hands-on",
        "description": "OpenRefine is the best tool to clean really dirty data — the kind of data in which the same name might be spelled in 30 different ways. It has built-in cleaning tools for analysts and journalists.",
        "speakers": "Nils Mulvad, Robert Gebeloff",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2971",
        "event_url": "https://ire.org/events-and-training/event/2702/2971/"
    },
    {
        "title": "Stories waiting to be told with housing data",
        "type": "Panel",
        "description": "",
        "speakers": "Tim Henderson, Skylar Olsen",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/2902",
        "event_url": "https://ire.org/events-and-training/event/2702/2902/"
    },
    {
        "title": "Structuring your data the right way the first time",
        "type": "Panel",
        "description": "",
        "speakers": "Sandhya Kambhampati",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2904",
        "event_url": "https://ire.org/events-and-training/event/2702/2904/"
    },
    {
        "title": "The election data you should be paying attention to",
        "type": "Panel",
        "description": "Election data isn't just results. Come learn about other datasets that help journalists and academics understand elections from people who use them. We’ll discuss voter files, election administration data and other sources, plus how to collaborate with researchers who already work in this area.",
        "speakers": "Rachel Shorey, Derek Willis, Daniel Smith",
        "date": "2017-03-02",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2903",
        "event_url": "https://ire.org/events-and-training/event/2702/2903/"
    },
    {
        "title": "Lunch on your own (Thursday)",
        "type": "Outside Event",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-02",
        "time_start": "12:30",
        "time_end": "14:15",
        "length_in_hours": 1.75,
        "room": "See printed schedule for room information",
        "event_id": "2702/2996",
        "event_url": "https://ire.org/events-and-training/event/2702/2996/"
    },
    {
        "title": "Conversations: Preparing for the worst case scenario (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "A systematic persecution of specific minority groups in America (like the Japanese internment camps in the 1940s) has again become a scary and real possibility. If you've felt similar fears, have thought about your own emergency plans, let's talk. This session is not for people who are simply curious about why others might feel this way. Come to this session to talk emergency plan tips, building a geographically diverse support system for if/when the time comes, what to do as self-care in the meantime, and to know that you're not alone.",
        "speakers": "Sisi Wei",
        "date": "2017-03-02",
        "time_start": "12:45",
        "time_end": "13:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2977",
        "event_url": "https://ire.org/events-and-training/event/2702/2977/"
    },
    {
        "title": "Finding and telling data stories with Tableau Public (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Got a dataset and an impending deadline to write a story on it? Find the scoop and convey it with beautiful, interactive visualizations in a serial narrative using Tableau Public. It’s a fast, easy to use, and free tool for journalists. Visualizations will publish using any CMS and no programming is required.\n\nWe’ll teach you how to:\n\n*Connect to Excel files and other file types\n\n*Rapidly explore and analyze datasets with ease\n\n*Make eye-catching visualizations to share your findings\n\n*Add interactivity and arrange them in a serial narrative to engage and sustain your audience’s attention\n\nTableau Public is a free tool for journalists. No previous experience with Tableau is necessary to attend. Laptops will be provided. This is a free training, however you must be registered for the CAR Conference to attend this class. Limited seats are available. There may be a few seats available on-site.\n\nRegister for this class.",
        "speakers": "Ben Jones",
        "date": "2017-03-02",
        "time_start": "13:30",
        "time_end": "15:00",
        "length_in_hours": 1.5,
        "room": "City Terrace 4",
        "event_id": "2702/3017",
        "event_url": "https://ire.org/events-and-training/event/2702/3017/"
    },
    {
        "title": "Analyzing satellite imagery with Google Earth Engine",
        "type": "Hands-on",
        "description": "Learn the basics of Earth Engine, Google's planetary-scale platform for geospatial analysis and visualization. Earth Engine (sister to Google Earth) has long been used by scientists quantifying differences on the Earth's surface. See how journalists at places like Reveal, Berliner Morgenpost and The New York Times have used the free tool to speed up normally complex and resource-intensive tasks and get hands-on with the Earth Engine API.\n\nFamiliarity with GIS/remote sensing and satellite imagery is a plus, but not required. We'll be coding with the JavaScript API, but no prior JS experience is necessary. For Earth Engine access, go to: https://signup.earthengine.google.com.",
        "speakers": "Vanessa Schneider, Chris Herwig, Eric Sagara",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3096",
        "event_url": "https://ire.org/events-and-training/event/2702/3096/"
    },
    {
        "title": "Battling burnout in a tweet-breaking world",
        "type": "Panel",
        "description": "**Moderated by Andy Boyle, Axios",
        "speakers": "Darla Cameron, Nikole Hannah-Jones, Andy Boyle",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3135",
        "event_url": "https://ire.org/events-and-training/event/2702/3135/"
    },
    {
        "title": "Building your own database",
        "type": "Panel",
        "description": "**Moderated by Meghan Hoyer, The Associated Press",
        "speakers": "Meghan Hoyer, Sarah Ryley, John Schoen",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3089",
        "event_url": "https://ire.org/events-and-training/event/2702/3089/"
    },
    {
        "title": "Covering K-12 while battling FERPA",
        "type": "Panel",
        "description": "",
        "speakers": "Nathaniel Lash, Jennifer Peebles, Jennifer Smith Richards",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3133",
        "event_url": "https://ire.org/events-and-training/event/2702/3133/"
    },
    {
        "title": "Design track: Dataviz workflows -  Unexpected ways to use tools to publish print & web graphics (Sponsored by Society for News Design)",
        "type": "Hands-on",
        "description": "Using tools such as AI2HTML and SVG Crowbar to go from the web to print and back again.",
        "speakers": "Ka Kay Rebecca Lai, Troy Griggs",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3051",
        "event_url": "https://ire.org/events-and-training/event/2702/3051/"
    },
    {
        "title": "Digital security preparation for reporting abroad",
        "type": "Hands-on",
        "description": "You're traveling abroad to cover a story: What steps can you take to secure your data, your devices, and your sources before heading to the airport? What are the pros and cons of bringing a burner into the field? How should you send notes to your editor before returning home? This hands-on workshop is designed to address the digital security needs of journalists as they travel overseas. Participants can expect to demo a number of software solutions and security practices — with particular focus paid to mobile and desktop security and file encryption.",
        "speakers": "Olivia Martin",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/2952",
        "event_url": "https://ire.org/events-and-training/event/2702/2952/"
    },
    {
        "title": "From drugs to doctors: Uncovering stories in health data",
        "type": "Panel",
        "description": "**Moderated by Kristin Hussey, independent journalist",
        "speakers": "Jeff Ernsthausen, Nicole Vap, Kristin Hussey, Ryan McNeill",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3134",
        "event_url": "https://ire.org/events-and-training/event/2702/3134/"
    },
    {
        "title": "Getting started with Excel",
        "type": "Hands-on",
        "description": "In this introduction to spreadsheets you'll begin analyzing data with Excel, a simple but powerful tool. You'll learn how to enter data, sort it and conduct simple calculations like average and median.",
        "speakers": "Jill Riepenhoff",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2937",
        "event_url": "https://ire.org/events-and-training/event/2702/2937/"
    },
    {
        "title": "Intro to Python 1",
        "type": "Hands-on",
        "description": "Want to upgrade your data skills? Come learn the Python programming language for a three-hour span. Geared toward beginners, this class with go over language basics and introduce you to key concepts. You'll then take your new Python skills and learn how to automate simple tasks, as well as how to collect and manipulate data in pursuit of stories.",
        "speakers": "Liz Lucas",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2936",
        "event_url": "https://ire.org/events-and-training/event/2702/2936/"
    },
    {
        "title": "Meet the Computational Journalism Workbench",
        "type": "Special Event",
        "description": "The Computational Journalism Workbench combines scraping, analysis, and visualization in one easy tool. It works by assembling simple modules into a “workflow,” a repeatable, sharable, automatically updating pipeline that produces a publishable chart or a live API endpoint. Use off the shelf modules to monitor data sources for changes, scrape sites, clean data, or even crowdsource a data processing task. No programming experience is necessary, but each module is just Python under the hood, making it infinitely extensible. Think of it as If This Then That for data journalism, with the power of Jupyter notebook and Chartbuilder built in.",
        "speakers": "Jonathan Stray",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/3009",
        "event_url": "https://ire.org/events-and-training/event/2702/3009/"
    },
    {
        "title": "NPR responsive graphics tool",
        "type": "Demo",
        "description": "",
        "speakers": "Sergio Hernandez, Matt Stiles, Alyson Hurt",
        "date": "2017-03-02",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3022",
        "event_url": "https://ire.org/events-and-training/event/2702/3022/"
    },
    {
        "title": "Big data in small organizations: How we created data-driven projects and stories at a startup",
        "type": "Panel",
        "description": "Whether you're a team of one, a small startup or battling despots abroad, we'll tell you how to pull off data-focused stories and projects with few dedicated resources. Our panel features journalists working with and within small teams in the U.S. and abroad who manage to produce stories and investigations with impact using data. We’ll share tips and tools to make you more efficient and project examples to show you what’s possible for a data journalist in a small shop. We’ll also talk about how to avoid mistakes, find mentors and get buy-in from others.",
        "speakers": "Eva Constantaras, Brent Jones, Ziva Branstetter",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2900",
        "event_url": "https://ire.org/events-and-training/event/2702/2900/"
    },
    {
        "title": "Design track: Intro to D3 (Sponsored by Society for News Design)",
        "type": "Hands-on",
        "description": "",
        "speakers": "Darla Cameron, Ashley Wu",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3052",
        "event_url": "https://ire.org/events-and-training/event/2702/3052/"
    },
    {
        "title": "How to build VR interactives using Digital Elevation Model (DEM) data and Three.js",
        "type": "Hands-on",
        "description": "Lights, camera, liftoff! In this session we'll learn how to create a three-dimensional virtual reality scene using Three.js and terrain data from NASA.\n\nUsing the L.A. Times' \"Discovering Gale Crater\" interactive, we'll walk you through how to import elevation data, turn a flat plane into a geographic surface, and map a terrain texture (basically a high-resolution photograph) onto that object. Then, we'll learn how to integrate controls for desktop and mobile devices and how to use pre-existing elements to turn the 3D scene into a virtual reality experience.\n\nWe'll also look at ways people have riffed on this technique, including tracking a week in the life of a mountain lion in Griffith Park.",
        "speakers": "Armand Emamdjomeh, Joe Fox",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3063",
        "event_url": "https://ire.org/events-and-training/event/2702/3063/"
    },
    {
        "title": "How to bulletproof your data story",
        "type": "Panel",
        "description": "We walk through all the steps you need to take to make sure the data you've been slaving over for months cannot be dismissed by naysayers. We give managers the questions they should ask to help reporters think through their approach to data. And we sound warning bells for some of the most dangerous mistakes and assumptions that come up in using data in the newsroom.",
        "speakers": "Jennifer Forsyth, Joel Engelhardt",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3111",
        "event_url": "https://ire.org/events-and-training/event/2702/3111/"
    },
    {
        "title": "Intro to Python 2",
        "type": "Hands-on",
        "description": "Want to upgrade your data skills? Come learn the Python programming language for a three-hour span. Geared toward beginners, this class with go over language basics and introduce you to key concepts. You'll then take your new Python skills and learn how to automate simple tasks, as well as how to collect and manipulate data in pursuit of stories.",
        "speakers": "Cathy Deng",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2938",
        "event_url": "https://ire.org/events-and-training/event/2702/2938/"
    },
    {
        "title": "Scraping data without coding",
        "type": "Hands-on",
        "description": "Scraping is a ​technical word for a traditional idea: getting ahold of information, whether or not your sources want you to. In this case, the information is data and the sources are websites. We'll go over some out-of-the-box tools for scraping data, plus some DIY techniques that often work even better.",
        "speakers": "Hilary Niles, Samantha Sunne",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3097",
        "event_url": "https://ire.org/events-and-training/event/2702/3097/"
    },
    {
        "title": "The agile data analyst: Applying practices from agile software methodologies to data reporting",
        "type": "Panel",
        "description": "**Moderated by Troy Thibodeaux, The Associated Press",
        "speakers": "Christopher Groskopf, Rachel Shorey, Troy Thibodeaux, Tyler Fisher",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3011",
        "event_url": "https://ire.org/events-and-training/event/2702/3011/"
    },
    {
        "title": "The first 100 days in data",
        "type": "Panel",
        "description": "**Moderated by Liz Lucas, Kaiser Health News",
        "speakers": "Michael Corey, Meghan Hoyer, Margaret Janz, Liz Lucas",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3039",
        "event_url": "https://ire.org/events-and-training/event/2702/3039/"
    },
    {
        "title": "Using formulas in Excel",
        "type": "Hands-on",
        "description": "Have you missed trigonometry since high school? No? Didn't think so. We haven't either. But, we have learned formulas can be fun, fairly easy and extraordinarily helpful with Microsoft Excel. Join us for this session, Excel 2, and learn how you can make Microsoft do all your math for you, giving you all kinds of additional insight and statistics to make your stories stronger.",
        "speakers": "Dinah Pulver",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2939",
        "event_url": "https://ire.org/events-and-training/event/2702/2939/"
    },
    {
        "title": "Visualizing data with SandDance",
        "type": "Demo",
        "description": "",
        "speakers": "Callie Neylan, Marilyn Harris",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2905",
        "event_url": "https://ire.org/events-and-training/event/2702/2905/"
    },
    {
        "title": "Your newsroom has a drone. Now what?",
        "type": "Special Event",
        "description": "",
        "speakers": "Matt Waite",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/3049",
        "event_url": "https://ire.org/events-and-training/event/2702/3049/"
    },
    {
        "title": "Designing Tableau Visualizations for mobile (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Are mobile readers of your news site becoming more and more common? If your news organization is like others we’ve worked with, the percent of readers using phones and tablets to read your content is well over half of the overall number, and growing fast. Creating data visualizations for these small form-factors is very challenging. Learn how to use Tableau to create sheets and dashboards that work great, even on phones and tablets.\n\n*Design considerations, including layout and formatting\n\n*Dashboard sizing for a range of screen widths\n\n*Utilizing Device Specific Designer for multi-screen support\n\n*Interactivity – filtering and tooltips\n\n*Options to embed visualizations to respond to reader device\n\nTableau Public is a free tool for journalists. Some experience with Tableau Public is recommended. Taking one of the earlier Tableau sessions should suffice. Laptops will be provided. This is a free training, however you must be registered for the CAR Conference to attend this class. Limited seats are available. There may be a few seats available on-site.\n\nRegister for this class.",
        "speakers": "Jenny Richards",
        "date": "2017-03-02",
        "time_start": "15:30",
        "time_end": "17:00",
        "length_in_hours": 1.5,
        "room": "City Terrace 4",
        "event_id": "2702/3018",
        "event_url": "https://ire.org/events-and-training/event/2702/3018/"
    },
    {
        "title": "A hitchhiker's guide To APIs",
        "type": "Hands-on",
        "description": "In this hands-on session, you will use Postman to interrogate a web API. David Eads (NPR) and Helga Salinas (Seattle Times) will guide you through the process of constructing a magic URL that will tell you how Chicago’s violent crime in 2016 compares to other years.\n\nThis session is for beginners. If you’ve ever thought about what goes on in the location bar of your browser, have an eye for patterns, or want better ways to answer your reporting questions, you’ll have a blast.",
        "speakers": "David Eads",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3064",
        "event_url": "https://ire.org/events-and-training/event/2702/3064/"
    },
    {
        "title": "Advanced social media sleuthing",
        "type": "Hands-on",
        "description": "Learn how to use social media tools to build profiles of people and their connections (and see what people can learn about you!)",
        "speakers": "Steve Myers",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3073",
        "event_url": "https://ire.org/events-and-training/event/2702/3073/"
    },
    {
        "title": "Design track: Intermediate D3 (Sponsored by Society for News Design)",
        "type": "Hands-on",
        "description": "We’ll tackle some of the more complicated chart forms in D3, cover advanced data manipulation functions, and include tons of real-world examples of how you can turn your own data into D3 charts.",
        "speakers": "John Muyskens, Leslie Shapiro",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3053",
        "event_url": "https://ire.org/events-and-training/event/2702/3053/"
    },
    {
        "title": "Embrace the data! How to turn data into characters in your story",
        "type": "Panel",
        "description": "A lot of reporters are afraid of losing people’s interest by using too many numbers in stories. But data can be just as engaging as any human character, if you know how to use it as a storyteller. Our panel will show you how to turn data into compelling characters that help drive the story, create tension and make people care. We will show you how even the most complicated data can be explored in ways that engage and surprise people. We’ll guide you through how APM Reports used data as a character in an investigative podcast, In the Dark. And we'll look at the dos and don'ts of data sonification to put data front and center. And we’ll show you how to incorporate the same techniques into other stories -- both for broadcast and print/online.",
        "speakers": "Michael Corey, Madeleine Baran, William Craft",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3040",
        "event_url": "https://ire.org/events-and-training/event/2702/3040/"
    },
    {
        "title": "How to make data approachable for younger audiences",
        "type": "Panel",
        "description": "Millennials - gotta catch 'em all. We'll tell you how to structure your data stories and interactives so younger audiences are drawn to your takeaways and will ultimately share with their friends.",
        "speakers": "Ani Ucar, Rachel Schallom",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/2906",
        "event_url": "https://ire.org/events-and-training/event/2702/2906/"
    },
    {
        "title": "Intro to Python 3",
        "type": "Hands-on",
        "description": "Want to upgrade your data skills? Come learn the Python programming language for a three-hour span. Geared toward beginners, this class with go over language basics and introduce you to key concepts. You'll then take your new Python skills and learn how to automate simple tasks, as well as how to collect and manipulate data in pursuit of stories.",
        "speakers": "Alex Richards",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2940",
        "event_url": "https://ire.org/events-and-training/event/2702/2940/"
    },
    {
        "title": "Investigating racial inequity (Sponsored by Ida B. Wells Society)",
        "type": "Panel",
        "description": "",
        "speakers": "Ron Nixon, Nikole Hannah-Jones",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3020",
        "event_url": "https://ire.org/events-and-training/event/2702/3020/"
    },
    {
        "title": "Mining data from the social web (demo)",
        "type": "Demo",
        "description": "From President Donald Trump’s Twitter account to fake news — social media platforms have become a major source for news.\n\nThis demo session will give journalists the ability to harvest information from the social web in structured and automated ways. Participants will learn how to collect information from Facebook pages and Twitter accounts via scraping and APIs and turn them into spreadsheets.\n\nTo get the most out of this demo: Attendees should have a basic grasp of programming concepts but do not need to be proficient in coding. Attendees should have their own Twitter and Facebook accounts and create app IDs for API access in advance of the session. If you want to follow along in this demonstration, make sure you have Python, pip and git installed on your laptop.",
        "speakers": "Lam Thuy Vo, Cathy Deng",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3112",
        "event_url": "https://ire.org/events-and-training/event/2702/3112/"
    },
    {
        "title": "Open 3d sandbox",
        "type": "Special Event",
        "description": "Make something in 3D in 10 minutes! We'll bring the basics for a three.js scene along with a bucket of assets so people can mix and match while learning how to build 3D interactives. Please bring your computer to this session.",
        "speakers": "Joe Fox, Armand Emamdjomeh",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/3050",
        "event_url": "https://ire.org/events-and-training/event/2702/3050/"
    },
    {
        "title": "PivotTables in Excel",
        "type": "Hands-on",
        "description": "",
        "speakers": "Kimbriell Kelly",
        "date": "2017-03-02",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2941",
        "event_url": "https://ire.org/events-and-training/event/2702/2941/"
    },
    {
        "title": "Welcome reception",
        "type": "Reception",
        "description": "Kick off the conference with a welcome reception on Thursday night beginning at 6 p.m. Meet up with friends you have not seen since last year and welcome new attendees. Each attendee will receive one drink ticket for beer, wine, soda or bottled water.",
        "speakers": "TBA",
        "date": "2017-03-02",
        "time_start": "18:00",
        "time_end": "19:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2995",
        "event_url": "https://ire.org/events-and-training/event/2702/2995/"
    },
    {
        "title": "Mentoring Breakfast (Co-sponsored by Donald W. Reynolds Journalism Institute and Google) *invitation-only",
        "type": "Special Event",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "07:45",
        "time_end": "20:45",
        "length_in_hours": 13.0,
        "room": "River Terrace 2",
        "event_id": "2702/3146",
        "event_url": "https://ire.org/events-and-training/event/2702/3146/"
    },
    {
        "title": "Conference registration (Friday)",
        "type": "Special Event",
        "description": "Registration will be located on the 3rd floor Skybridge of the Hyatt Regency Jacksonville Riverfront.",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "08:00",
        "time_end": "17:00",
        "length_in_hours": 9.0,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3001",
        "event_url": "https://ire.org/events-and-training/event/2702/3001/"
    },
    {
        "title": "Conference sales (Friday)",
        "type": "Special Event",
        "description": "Stop by the NICAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the NICAR T-shirt contest.",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "08:00",
        "time_end": "17:00",
        "length_in_hours": 9.0,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3005",
        "event_url": "https://ire.org/events-and-training/event/2702/3005/"
    },
    {
        "title": "Conversations: How to be the caring human being behind the job posting (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "Hiring is hard and time consuming. I believe that people want to have an intentional and caring hiring process, but it's easy for things to fall through the cracks. We'll talk about tangible solutions to make this process better.",
        "speakers": "Rachel Schallom",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2978",
        "event_url": "https://ire.org/events-and-training/event/2702/2978/"
    },
    {
        "title": "Data crunching in Python (for people who only know Excel)",
        "type": "Hands-on",
        "description": "An intro-level session for people who are comfortable with spreadsheets but want to start working with data in Python.\n\nWe won't be using pandas, Agate or any other popular data analysis libraries; instead, we'll focus on a few common Excel tasks and walk through basic data types and equivalent functionality in Python's standard library.\n\n(It's cool if you already know how to make a Python script go, but no big deal if you don't.)",
        "speakers": "Cody Winchester",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3099",
        "event_url": "https://ire.org/events-and-training/event/2702/3099/"
    },
    {
        "title": "How to find stories in data: Data exploration and storytelling",
        "type": "Hands-on",
        "description": "This session will introduce you to ways to use data as a source to tell stories. We’ll demonstrate techniques and tools to interrogate data for answers — gathering, cleaning, organizing and analyzing data to find and tell stories.\n\nThe three topics we will focus on in this hour are:",
        "speakers": "Heather Krause",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/2942",
        "event_url": "https://ire.org/events-and-training/event/2702/2942/"
    },
    {
        "title": "How to use polls and rankings – and how to tell the good from bad",
        "type": "Panel",
        "description": "Quick survey: how many of you are inundated with press releases about polls, rankings, and best-of lists? You know your readers love that kind of thing, but you don’t want to mislead them with bad data or overstating the results. Maybe the election has you questioning its value in general. We’ll give you the tools you need to quickly sort out what’s worth covering. But let’s go further: You’ll see some real-life examples of even more interesting ways to incorporate this data into your story-telling and reporting.",
        "speakers": "Matt Carmichael, Peter Gade, Chris Jackson",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3047",
        "event_url": "https://ire.org/events-and-training/event/2702/3047/"
    },
    {
        "title": "Intro to R: Stepping up your analysis game (beginner)",
        "type": "Hands-on",
        "description": "",
        "speakers": "Charles Minshew",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2943",
        "event_url": "https://ire.org/events-and-training/event/2702/2943/"
    },
    {
        "title": "The lone trainer: Ideas for boosting data literacy in your newsroom",
        "type": "Panel",
        "description": "",
        "speakers": "Jennifer LaFleur, Ronald Campbell",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/2907",
        "event_url": "https://ire.org/events-and-training/event/2702/2907/"
    },
    {
        "title": "The perils, pitfalls and payoffs of working with higher ed data (Sponsored by Lumina Foundation)",
        "type": "Panel",
        "description": "With college costs at record levels, and student debt topping $1.2 trillion, data on colleges is more critical than ever before. In the last year alone, colleges have been at the crux of major national controversies including sexual assault on campus, the rights of undocumented students, and tensions over political speech. This panel will take you through several major higher education data sets that will help you tell those stories. We'll explore data on student debt, campus demographics, and campus crime and talk about the pros and cons of using each data set.",
        "speakers": "Jennifer Forsyth, Holly Hacker",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3041",
        "event_url": "https://ire.org/events-and-training/event/2702/3041/"
    },
    {
        "title": "Uncovering the influence",
        "type": "Panel",
        "description": "",
        "speakers": "Sandra Fish, Ben Wieder, Derek Willis",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3113",
        "event_url": "https://ire.org/events-and-training/event/2702/3113/"
    },
    {
        "title": "Visualization and analysis in Python",
        "type": "Hands-on",
        "description": "So you're familiar with Python and some of its core concepts. How do you use that to crunch large amounts of data and records into stories and data visualizations quickly and easily? In this hands-on course, we'll show you our tips and tricks in using our favorite Python tools to do just that. You’ll walk out knowing how to go from analysis to publishable graphics in just a few minutes. The tools we'll be using: Seaborn (statistical data viz library), matplotlib (plotting library), pandas (data analysis tool), and Jupyter notebooks.",
        "speakers": "Nathaniel Lash, Adam Playford",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/2947",
        "event_url": "https://ire.org/events-and-training/event/2702/2947/"
    },
    {
        "title": "Excel Magic (beginner/intermediate) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "If you've found yourself struggling in a spreadsheet, thinking that whatever you were trying to achieve seemed harder than it should've been, then this is the class for you. You'll learn how to do things with spreadsheets that you never thought possible, such as joining tables and re-arranging badly structured data. You'll learn about the never-ending and amazing power of logical functions, as well as a whole bunch of other functions you probably didn't know about (but should). You'll also learn some handy tools for dealing with dates, times and strings of text that aren't quite the way you'd like them. Plus we'll throw in some other tricks that just make working in spreadsheets a bit easier and more efficient.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: You should have prior experience using Excel or Google Sheets, and be comfortable with introductory-level spreadsheet skills, such as sorting, filtering, SUM and AVERAGE functions, calculations such as percentage change or percent of total, and how to use Pivot Tables.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "MaryJo Webster",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "City Terrace 9",
        "event_id": "2702/2881",
        "event_url": "https://ire.org/events-and-training/event/2702/2881/"
    },
    {
        "title": "When Excel is not enough, you SQL",
        "type": "Hands-on",
        "description": "",
        "speakers": "Crina Boros",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "City Terrace 11",
        "event_id": "2702/2991",
        "event_url": "https://ire.org/events-and-training/event/2702/2991/"
    },
    {
        "title": "First Python Notebook: Rapid data analysis in the newsroom (beginner/intermediate) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Ben Welsh, James Gordon and Cheryl Phillips teach you how to conduct and publish a data analysis with the Python programming language, its pandas toolkit and a Jupyter Notebook.\n\nThe 6-hour, hands-on tutorial will guide you through an investigation of money in politics using data from the California Civic Data Coalition. You will learn just enough Python to do damage with the powerful pandas data analysis library, the most popular open-source library for working with large data files. You will also learn how to record, remix and republish your analysis using the Jupyter Notebook, a browser-based tool for writing code that is emerging as the standard for sharing reproducible research in the sciences. And most importantly, you will see how tools can increase the speed and veracity of your journalism.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: If you've tried Python once or twice, have good attitude and know how to take a few code crashes in stride, you are qualified for this class.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "James Gordon, Cheryl Phillips, Ben Welsh",
        "date": "2017-03-03",
        "time_start": "09:00",
        "time_end": "16:30",
        "length_in_hours": 7.5,
        "room": "City Terrace 4",
        "event_id": "2702/2879",
        "event_url": "https://ire.org/events-and-training/event/2702/2879/"
    },
    {
        "title": "Kiss your apps goodbye: Saving born-digital news",
        "type": "Demo",
        "description": "The longevity of digital news content is about the same as the lifespan of an earthworm - about 100 days. As founder of the Dodging the Memory Hole initiative, digital curator of journalism Edward McCain is working to ensure long-term access to journalistic content. In today’s digital newsrooms, a software or hardware crash can wipe out decades of texts, photos, videos and applications. Furthermore, digital archives can become obsolete if they aren’t adapted to evolving formats and systems. A 2014 study by the Reynolds Journalism Institute shows that 17 percent of online-only organizations have already experienced just this kind of damage. Come learn how to keep your content alive and accessible for future generations.",
        "speakers": "Edward McCain",
        "date": "2017-03-03",
        "time_start": "09:30",
        "time_end": "10:00",
        "length_in_hours": 0.5,
        "room": "River Terrace 2",
        "event_id": "2702/2908",
        "event_url": "https://ire.org/events-and-training/event/2702/2908/"
    },
    {
        "title": "Brain flipping: Tips for switching between the sides of your brain",
        "type": "Panel",
        "description": "Working with data means that many of us are flipping our brains between analytical tasks, such as coding and querying and more creative tasks, such as writing and designing.This session will give you some tools for helping both sides of your brain do a better job.\n\nTelling narratives in data investigations stories with data – or maybe, some of the best narrative stories by people who also work with data.\n\n**Moderated by Jennifer LaFleur, Reveal from the Center for Investigative Reporting",
        "speakers": "Leah Kohlenberg, Scott Pham, Jennifer LaFleur",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3036",
        "event_url": "https://ire.org/events-and-training/event/2702/3036/"
    },
    {
        "title": "Broadcast: Transforming data into knockout visuals",
        "type": "Panel",
        "description": "",
        "speakers": "Mc Nelly Torres, Josh Hinkle, Cecil Rosner",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3012",
        "event_url": "https://ire.org/events-and-training/event/2702/3012/"
    },
    {
        "title": "Common foundations for newsroom tools",
        "type": "Panel",
        "description": "",
        "speakers": "Allan James Vestal, Chris Amico, Daniele Palumbo, Casey Miller",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2909",
        "event_url": "https://ire.org/events-and-training/event/2702/2909/"
    },
    {
        "title": "Conversations: Open source in the newsroom (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "At OpenNews, we're working on a community-written guidebook to tackle a mutual challenge: how to produce open source projects. We've seen a common set of cultural and technical questions coming up before, during, and after projects--but our community doesn't have a common pool of answers. More open source software means more time for meaningful journalism, less time spent recreating code. In this conversation, we'll talk about this new guidebook, share expertise with each other around open source in the newsroom, and ask how this resource could be helpful to you and your colleagues.",
        "speakers": "Lindsay Muscato, Erin Kissane, Ryan Pitts",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2979",
        "event_url": "https://ire.org/events-and-training/event/2702/2979/"
    },
    {
        "title": "Data analysis in R (beginner)",
        "type": "Hands-on",
        "description": "Learn how to sort, filter, join and carry out some other basic functions in R to identify trends in your data for storytelling.",
        "speakers": "Peter Aldhous",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2946",
        "event_url": "https://ire.org/events-and-training/event/2702/2946/"
    },
    {
        "title": "Designing database applications for community engagement (Hosted by Caspio)",
        "type": "Hands-on",
        "description": "Investigative journalists have great ideas, and many are seeking fast, innovative solutions that allow them to publish interactive data applications by deadline. Caspio has the tools to allow you to do this, without the help of a staff developer.\n\nWith a little bit of training, you can learn how to develop your own data-driven apps, interactives, consumer investigative sites, and community engagement tools using Caspio.\n\nThis demo will showcase real-world examples and techniques for building revenue-generating database applications. Creative community engagement has never been easier.\n\nNote: Pre-registration is not required.",
        "speakers": "Jennifer Christos, Sabina Tuladhar",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/2944",
        "event_url": "https://ire.org/events-and-training/event/2702/2944/"
    },
    {
        "title": "Gifs for data viz",
        "type": "Demo",
        "description": "Let’s take a look at why animated gifs work so well as explanatory tools; what kinds of charts, graphics, and data visualizations they’re best for; and how you can make your very own.",
        "speakers": "Lena Groeger",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2910",
        "event_url": "https://ire.org/events-and-training/event/2702/2910/"
    },
    {
        "title": "Github for journos (repeat session)",
        "type": "Hands-on",
        "description": "This session will teach you everything you need to know about collaboration on GitHub. We'll use GitHub.com and a user interface to interact with a real life project. You'll walk away feeling empowered to create your own projects, use existing projects, collaborate with colleagues remotely, and exploit coding workflows.",
        "speakers": "Hector Alfaro",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3074",
        "event_url": "https://ire.org/events-and-training/event/2702/3074/"
    },
    {
        "title": "Show me the money: Finding compensation gold in proxy statements",
        "type": "Hands-on",
        "description": "Want to quickly calculate how much Warren Buffett is worth? Wondering how much Mark Zuckerberg pays himself? The answers are readily available for those who know where to look. In filings with the Securities and Exchange Commission, thousands of publicly traded companies (and even some companies that don’t trade on a stock exchange) reveal a wealth of information about executive pay, perks and stock holdings. This hands-on session will show you where to find compensation data for companies you cover.",
        "speakers": "Jeff Ostrowski",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/2945",
        "event_url": "https://ire.org/events-and-training/event/2702/2945/"
    },
    {
        "title": "The present and future of bots",
        "type": "Panel",
        "description": "Expectations are very high in 2017 for bots, artificial intelligence and their usefulness to journalism.  But the definitions and boundaries between types of bots are murky at best.  Few journalistic bots are alike (if you don't count their clones).  And each newsroom's needs for bots are often unique.  Our panel of bot-builders will lead you on a guided tour of bots past, present and future.\n\n**Moderated by Tiff Fehr, The New York Times",
        "speakers": "John Keefe, Simon Rogers, Ken Schwencke, Tiff Fehr",
        "date": "2017-03-03",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3014",
        "event_url": "https://ire.org/events-and-training/event/2702/3014/"
    },
    {
        "title": "Conversations: Beyond objectivity - New standards for building trust in journalism (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "Ida B. Wells reported on lynchings through simple, clear questions and a systematic collection and analysis of data. However, Wells could not report on racist violence from a detached vantage point. She had friends who were murdered and was herself exiled from her home in Memphis after her newspaper's office was ransacked and her life was threatened. Many buying homes or choosing schools for their children, including reporters and editors, are implicated in systems intertwined with race, class and politics. However, few acknowledge that they aren't detached from these systems. Last year, Nikole Hannah-Jones used her background reporting about race, segregation and education to show how [her own experience choosing a school for her daughter](https://www.nytimes.com/2016/06/12/magazine/choosing-a-school-for-my-daughter-in-a-segregated-city.html?_r=0) exemplified broader issues in American education. Lewis Wallace, a reporter for Marketplace, reported being fired after publishing an [essay](https://medium.com/@lewispants/objectivity-is-dead-and-im-okay-with-it-7fd2b4b5c58f#.yzkh8bigt) questioning the reality of standards of objectivity and neutrality in news and surfacing the struggles he faces as a trans person who is specifically affected by policy.\n\nLet's start by accepting that objectivity and neutrality aren't real and that there is a crisis of audience trust in reporting. Let's also aknowledge that reporters and editors are consciously or unconciously implicated in many of the dynamics on which they cover, yet still do rigorous work. Finally, let's agree that not everyone in a newsroom is impacted by newsworthy events in the same way.\n\nFrom this starting point, let's talk about different standards that journalists are developing, either in their own practice, or at their organizations to address our personal implications in the news. How can or should reporters disclose their connections or orientations? What are the implications, if any, if reporters participate in protests or donate to causes? How have reporters taken political actions but remained fair and truthful in the reporting? What were the times when this wasn't possible? From this conversation, I hope we can develop sets of standards, personal and organizational that prioritize both our humanity and the integrity of our journalism.",
        "speakers": "Geoff Hing",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2980",
        "event_url": "https://ire.org/events-and-training/event/2702/2980/"
    },
    {
        "title": "Data analysis in Tableau",
        "type": "Hands-on",
        "description": "Tableau Desktop is a powerful data analysis tool that can crunch large datasets entirely with a visual interface and with more flexibility than SQL. This session will teach you how to join tables, query, group and filter, and visualize the results by simply dragging, dropping and clicking (okay, and a little typing). The software is free for IRE members.",
        "speakers": "Sarah Ryley",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3075",
        "event_url": "https://ire.org/events-and-training/event/2702/3075/"
    },
    {
        "title": "Data wrangling with Python",
        "type": "Hands-on",
        "description": "Much of the prerequisite for analysis involves loading, transforming, and storing data. We'll dig into Python libraries that are useful for reading from and writing to various data formats, including databases. Familiarity with Python and SQL is helpful but not essential.",
        "speakers": "Anthony DeBarros",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/2948",
        "event_url": "https://ire.org/events-and-training/event/2702/2948/"
    },
    {
        "title": "Doing data journalism under duress",
        "type": "Panel",
        "description": "**Moderated by Charles Lewis, Investigative Reporting Workshop",
        "speakers": "Anatoliy Bondarenko, Rigoberto Carvajal, Eva Constantaras, Charles Lewis",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3038",
        "event_url": "https://ire.org/events-and-training/event/2702/3038/"
    },
    {
        "title": "GIS with Python: 6 libraries to know",
        "type": "Demo",
        "description": "",
        "speakers": "Roberto Rocha",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2912",
        "event_url": "https://ire.org/events-and-training/event/2702/2912/"
    },
    {
        "title": "Gathering and cleaning data with R (intermediate)",
        "type": "Hands-on",
        "description": "Learn how to use R to scrape data from the web and pull data from APIs. This session will also look at how to clean and structure the data you've gathered in preparation for your analysis using tidyverse packages. Please note: You will need an API key for Zillow, so please sign up for one prior to this class.",
        "speakers": "Caelainn Barr",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2949",
        "event_url": "https://ire.org/events-and-training/event/2702/2949/"
    },
    {
        "title": "Google trends",
        "type": "Hands-on",
        "description": "Turning trends into stories\n\nGoogle Trends data can be a reflection of our collective curiosities. This data can be a powerful signal in reporting, as we’ve seen spikes in search interest showcasing how people are processing major events, and questions searched indicating what folks want to know most.\n\nJoin us as we discuss how to use Google Trends--whether it’s to discover your next story or to enrich and amplify one you’re currently working on.",
        "speakers": "Jennifer Lee",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/2972",
        "event_url": "https://ire.org/events-and-training/event/2702/2972/"
    },
    {
        "title": "Managing data projects & workflows",
        "type": "Panel",
        "description": "Large data projects can be a large pain in the neck and often require more planning and structure than is typical in most newsrooms. On this panel, we will discuss different approaches to managing large-scale data projects, what has worked and what hasn't.\n\n**Moderated by Matt Goldberg, NBC4 Los Angeles",
        "speakers": "Aron Pilhofer, Janet Roberts, Matt Goldberg",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3110",
        "event_url": "https://ire.org/events-and-training/event/2702/3110/"
    },
    {
        "title": "Visualizing and understanding uncertainty (Sponsored by Society for News Design)",
        "type": "Panel",
        "description": "Information graphics trigger an illusion of certainty, precision and even control over the situation they describe. But how often do we, as infographics and data visualization designers, really think deeply about whether most readers understand that the line in a time-series line chart has a fuzzy cloud of uncertainty behind it? Or if the 63.3 percent probability of winning a football game that we're reporting on could be rounded to 60 percent, and more clearly expressed as a 3 out of 5 chances? In some cases, statistics, as a discipline, can help us work out margins of error, but in other cases, the mathematics is frustratingly silent about the best strategy for expressing a range of plausible outcomes. How do we give data their wobble back? Join us in a conversation about the challenges of visualizing uncertainty in figures developed for broad audiences, and strategies for representing it effectively.",
        "speakers": "Alberto Cairo, Mark Hansen, Jen Christiansen",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3091",
        "event_url": "https://ire.org/events-and-training/event/2702/3091/"
    },
    {
        "title": "Jobs and career straight-talk: For (and by) young'uns only",
        "type": "Panel",
        "description": "",
        "speakers": "Madi Alexander, Rachel Schallom",
        "date": "2017-03-03",
        "time_start": "11:30",
        "time_end": "13:30",
        "length_in_hours": 2.0,
        "room": "River Terrace 3",
        "event_id": "2702/2911",
        "event_url": "https://ire.org/events-and-training/event/2702/2911/"
    },
    {
        "title": "Lunch on your own (Friday)",
        "type": "Outside Event",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "12:30",
        "time_end": "14:15",
        "length_in_hours": 1.75,
        "room": "See printed schedule for room information",
        "event_id": "2702/2997",
        "event_url": "https://ire.org/events-and-training/event/2702/2997/"
    },
    {
        "title": "Conversations: If newsrooms had Hogwarts personalities (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "In \"Harry Potter,\" students at Hogwarts School of Witchcraft and Wizardry are sorted into four houses: Gryffindor (the brave), Ravenclaw (the clever), Hufflepuff (the loyal), and Slytherin (the ambitious). This can be a useful framework for understanding personality clashes (and synergies) in the workplace. As House representatives, we* will take a Hogwartsian perspective on common newsroom issues. We will encourage participants to discover and discuss their own Hogwarts identities by taking the online quiz.\n\n*\"we\" are Gerald Rich (Axios, Gryffindor) - also identifies as Ravenclaw. sore loser in a Harry Potter costume competition (http://www.pinoyexchange.com/forums/printthread.php?t=478749&pp=20&page=170)\n\nChristine Zhang (OpenNews/freelance, Ravenclaw) - gave a lightning talk at MozFest 2016 on \"what Harry Potter taught me about journalism\" (https://twitter.com/christinezhang/status/792421131647082496)\n\nJeremy Bowers (NYT, Hufflepuff) - gave a lightning talk at SRCCON 2016 on \"Why you should hire Hufflepuffs\" (https://datanews.github.io/blitzen/)\n\nCasey Miller (Vox, Slytherin) - surveyed her co-workers about which Hogwarts House they thought each other belonged to -- and compared expectations with reality (https://storytelling.voxmedia.com/2016/9/23/13037226/how-our-remote-team-makes-time-to-bond)",
        "speakers": "Christine Zhang, Gerald Rich, Jeremy Bowers, Casey Miller",
        "date": "2017-03-03",
        "time_start": "12:45",
        "time_end": "13:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2981",
        "event_url": "https://ire.org/events-and-training/event/2702/2981/"
    },
    {
        "title": "Digging into data for stories: A crash course (beginner) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Kickstart your data skills with IRE's original mini-boot camp. This series of hands-on classes will introduce you to spreadsheets and databases with IRE's proven techniques. IRE's experienced trainers will walk you through sorting, calculating and interviewing data. You'll come away with a solid base for using data analysis in your own newsroom. In addition, we'll provide you with our boot camp materials to help keep you on track long after you leave the conference.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: There are no prerequisites for this workshop and beginners are welcome. This workshop is good for those wanting to get started analyzing data for stories\n\nWorkshop times are Friday, March 3, 2:15pm - 4:30pm; Saturday, March 4, 2:15pm - 5:45pm; Sunday, March 5, 9:00am - 12:30pm (Note: Registration for this session reserves your seat for all days of this workshop and attendees are expected to attend all sessions to complete the workshop.)\n\n**Speakers are IRE/NICAR Staff\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "12:30",
        "length_in_hours": -1.75,
        "room": "City Terrace 10/11",
        "event_id": "2702/2882",
        "event_url": "https://ire.org/events-and-training/event/2702/2882/"
    },
    {
        "title": "Advanced PDF manipulation",
        "type": "Hands-on",
        "description": "So now you know how to get data from basic pdfs and large batches. What about mixed formats, ongoing jobs etc?\n\nThis session will cover how to process pdfs in large batches, use Amazon Mechanical Turk, schedule OCR jobs to work while you aren't around, and build data pipeline. If you’re comfortable with the command line and Tesseract this is for you.",
        "speakers": "Miguel Barbosa",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/2950",
        "event_url": "https://ire.org/events-and-training/event/2702/2950/"
    },
    {
        "title": "Basic D3 (repeat session)",
        "type": "Hands-on",
        "description": "We’ll cover the basics of getting you started with D3, even if you’ve never used it before. Then we’ll take several real datasets and use them to create a few basic charts.",
        "speakers": "Chris Canipe, Jon McClure",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3076",
        "event_url": "https://ire.org/events-and-training/event/2702/3076/"
    },
    {
        "title": "Data to localize housing and economy stories",
        "type": "Panel",
        "description": "Keith will discuss finding, graphing, mapping, and sharing economic data from the St. Louis Fed’s free website FRED.  Attendees will leave the session able to find economic data by U.S. region such as state, metropolitan area, or county; create multi-series graphs and maps to compare indicators by geography; and download data.  Keith will also cover embedding graphs and maps in stories, saving frequently used graphs, and creating dashboards.  Dashboards are custom webpages created by the user that contain automatically updating data as graphs, tables, and data points.",
        "speakers": "Skylar Olsen, Keith Taylor",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3132",
        "event_url": "https://ire.org/events-and-training/event/2702/3132/"
    },
    {
        "title": "Design track: Interactive design (Sponsored by Society for News Design)",
        "type": "Panel",
        "description": "What the worst user interface ever can teach you about design.",
        "speakers": "Sarah Slobin",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/3128",
        "event_url": "https://ire.org/events-and-training/event/2702/3128/"
    },
    {
        "title": "Exploring environmental data",
        "type": "Panel",
        "description": "We'll look at primary data related to marine science--with a focus on coral reef research. We'll look at how scientists collect data from the ocean, and what it looks like once collected. The point of the session is to \"know your data,\" and in this case the data is all about the ocean. In addition, I'll be showing some data on fresh water that I received from Mark Nichols, who couldn't attend. We'll provide some samples to participants.\n\nDavid will be showing data related to toxins in the environment. Dinah will talk about her work as an environmental journalist. You'll receive more details from them.\n\nAll three of us will provide links to useful sites for locating environmental data.",
        "speakers": "David Heath, Dianne Finch, Dinah Pulver",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2919",
        "event_url": "https://ire.org/events-and-training/event/2702/2919/"
    },
    {
        "title": "Fighting First Amendment attacks",
        "type": "Panel",
        "description": "In this freewheeling open-mic session, the audience will share tactics to overcome attacks on First Amendment rights, including access to public records, data, documents and meetings. Bring your practical tips, success stories and tools to share. We'll crowdsource proven ways to overcome obstacles to getting the sources, data and documents you need.\n\n**Moderated by Doug Haddix, IRE/NICAR",
        "speakers": "Doug Haddix",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3129",
        "event_url": "https://ire.org/events-and-training/event/2702/3129/"
    },
    {
        "title": "QGIS I: Importing and displaying geographic data",
        "type": "Hands-on",
        "description": "Not all datasets need to be mapped, but some do! This mapping class is perfect for beginners looking to learn the basics of visualizing geographic data. We'll go over how to find publicly available data, prepare it for mapping, join datasets and use the open source mapping software, QGIS.",
        "speakers": "John Walton, Christine Jeavans",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/2959",
        "event_url": "https://ire.org/events-and-training/event/2702/2959/"
    },
    {
        "title": "Scraping data without coding (repeat session)",
        "type": "Hands-on",
        "description": "Scraping is a ​technical word for a traditional idea: getting ahold of information, whether or not your sources want you to. In this case, the information is data and the sources are websites. We'll go over some out-of-the-box tools for scraping data, plus some DIY techniques that often work even better.",
        "speakers": "Sydney Lupkin",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/2967",
        "event_url": "https://ire.org/events-and-training/event/2702/2967/"
    },
    {
        "title": "Unsung data",
        "type": "Panel",
        "description": "What makes a dataset sing? And what great datasets are underappreciated? Join us for a (totally subjective) romp through some of our favorites. We’ll look at data that have been used for award-winning, customized, sophisticated, localized, timely information — many with no programming, no software and no downloading needed.  A quick step-by-step guide to using them.",
        "speakers": "Dan Keating, Jeremy Singer-Vine",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3057",
        "event_url": "https://ire.org/events-and-training/event/2702/3057/"
    },
    {
        "title": "Watch the web for news tips with Klaxon",
        "type": "Special Event",
        "description": "",
        "speakers": "Tom Meagher",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2982",
        "event_url": "https://ire.org/events-and-training/event/2702/2982/"
    },
    {
        "title": "What's the impact?",
        "type": "Panel",
        "description": "**Moderated by James Hamilton, Stanford University\n\nInvestigative stories can change lives and laws, draw audiences, and generate new leads and partnerships. How can you put numbers on these impacts? This panel will try, through discussion of evidence from readership metrics, benefit-cost analyses, survey data, and case studies.",
        "speakers": "Lindsay Green-Barber, Celeste LeCompte, James Hamilton, Tom Rosenstiel",
        "date": "2017-03-03",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/2913",
        "event_url": "https://ire.org/events-and-training/event/2702/2913/"
    },
    {
        "title": "Co-op models in data journalism",
        "type": "Special Event",
        "description": "",
        "speakers": "Forest Gregg",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2983",
        "event_url": "https://ire.org/events-and-training/event/2702/2983/"
    },
    {
        "title": "Collaborating with the competition",
        "type": "Panel",
        "description": "Working with a rival news organization might seem like one of the great journalism no-nos, but successful collaborations can be a way for newsrooms around the country -- and the globe -- to combine their individual strengths and produce higher impact work than each organization could achieve on its own. Learn strategies and tools that will make it easier to play nice with the competition, produce awesome, data-driven investigations and take over the world.\n\n**Moderated by Ben Wieder, The Center for Public Integrity",
        "speakers": "Crina Boros, Sandhya Kambhampati, Jeff Kelly Lowenstein, Ben Wieder",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3118",
        "event_url": "https://ire.org/events-and-training/event/2702/3118/"
    },
    {
        "title": "Data & abuse of power",
        "type": "Panel",
        "description": "We need data on public institutions so that we can keep them accountable. But when that data is collected and shared by the institution itself, they are in a powerful position to control the narrative. What can we as data practitioners do to help identify potentially biased narratives that could exist in this type of data? Because blindly trusting a biased dataset is just as harmful as blindly trusting a biased source. We would like to talk a little about a vetting process, and about a few important types of biases in data that you should have in mind. This list is by no means complete and is still a work in progress, but it includes some of the more major types of bias that we’ve noticed in data, and what we think you can do about them.",
        "speakers": "Anna Flagg, Moiz Syed",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/2914",
        "event_url": "https://ire.org/events-and-training/event/2702/2914/"
    },
    {
        "title": "Data journalism from space",
        "type": "Demo",
        "description": "For decades, time-sensitive satellite imagery has been expensive and accessible mostly to governments and large corporations. Recent advances in consumer technologies are making satellite technology cheaper, and new business models are making the production of space-bound hardware and imagery more democratized. Planet Labs, a startup founded by ex-NASA engineers, has the largest constellation of Earth-imaging satellites ever and aims to image the entire planet every day to track global events and challenges like climate change, deforestation, refugee camp growth, disaster response, and many others. The high frequency of Planet's imagery creates new opportunities to capture insight on significant local and global change and is able to move at the rapid rate of today’s 24-hour news cycle. Recent stories include coverage of deforestation in Bolivia, illegal gold mining in Peru, a collapsing glacier, and discovery of North Korean missile tests. As a unique source of data, Planet's imagery is available to approved journalists and socially-impactful projects.",
        "speakers": "Sara Schnadt,",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2915",
        "event_url": "https://ire.org/events-and-training/event/2702/2915/"
    },
    {
        "title": "Design track: User testing - Gathering insight to make better stories (Sponsored by Society for News Design)",
        "type": "Panel",
        "description": "Is your story clear? Do people see that search field? Does that button work the way you think it does? Find out how to answer these questions by talking to a few outside people. It’s easy, it’s cheap, and it works. Bonus: Bring a project you’re working on and learn how to test it.",
        "speakers": "Hannah Birch, Clarisa Diaz",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/3127",
        "event_url": "https://ire.org/events-and-training/event/2702/3127/"
    },
    {
        "title": "Intermediate D3 (repeat session)",
        "type": "Hands-on",
        "description": "We’ll tackle some of the more complicated chart forms in D3, cover advanced data manipulation functions, and include tons of real-world examples of how you can turn your own data into D3 charts.",
        "speakers": "Chris Canipe, Jon McClure",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3077",
        "event_url": "https://ire.org/events-and-training/event/2702/3077/"
    },
    {
        "title": "Intro to Javascript",
        "type": "Hands-on",
        "description": "Functions, for loops and objects. They can be confusing at first but once you master these and other Javascript coding conventions, you'll be able to build fancy data visualizations and more. In this course, we will be learning the basics of Javascript. No coding experience is necessary.",
        "speakers": "Chris Essig",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/2951",
        "event_url": "https://ire.org/events-and-training/event/2702/2951/"
    },
    {
        "title": "News games and simulations",
        "type": "Panel",
        "description": "",
        "speakers": "Amanda Hickman, Sandeep Junnarkar",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3136",
        "event_url": "https://ire.org/events-and-training/event/2702/3136/"
    },
    {
        "title": "Phil Meyer Award winners deep dives",
        "type": "Panel",
        "description": "The winners of the Philip Meyer Award take you behind the scenes and offer insights, tips, and strategies that helped them pull off their award-winning work. These projects included a sophisticated data investigation that revealed doctors who had sexually abused their patients; an innovative tracking system showing how wildfires spread in the West; and a data-driven investigation that exposed match-fixing in professional tennis.\n\n**Moderated by Jodi Upton, Syracuse University",
        "speakers": "Jeff Ernsthausen, Scott Pham, Eric Sagara, John Templon, Jodi Upton",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3042",
        "event_url": "https://ire.org/events-and-training/event/2702/3042/"
    },
    {
        "title": "QGIS II: Manipulating, editing and analyzing geographic data",
        "type": "Hands-on",
        "description": "Dive even deeper into data mapping in this continuation of QGIS I. This class will cover joining data tables to maps, aggregating point data for easier analysis and preparing geographic data for display online. It is strongly recommended that you take QGIS I immediate preceding this session, but it is not a strict requirement.",
        "speakers": "Alexandra Kanik",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/2962",
        "event_url": "https://ire.org/events-and-training/event/2702/2962/"
    },
    {
        "title": "Reproducibility and Rmarkdown: How to use R regularly in your newsroom (intermediate)",
        "type": "Hands-on",
        "description": "Learn how to turn your most commonly created custom lines of R code into a function and package for future use. Communicate your findings to others in the newsroom easily with R Markdown. Share all to your Github repo through RStudio for others to download and use or update.",
        "speakers": "Andrew Tran",
        "date": "2017-03-03",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3078",
        "event_url": "https://ire.org/events-and-training/event/2702/3078/"
    },
    {
        "title": "Lightning Talks (Sponsored by the Knight Foundation)",
        "type": "Panel",
        "description": "**Moderated by Sisi Wei, ProPublica\n\nSometimes you don't need 45 minutes to explain a useful technique or interesting resource. Join your colleagues for a session of short (5-minute) talks about doing CAR, Web development or other related topics.",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "16:45",
        "time_end": "18:00",
        "length_in_hours": 1.25,
        "room": "Conference Center A&B",
        "event_id": "2702/2992",
        "event_url": "https://ire.org/events-and-training/event/2702/2992/"
    },
    {
        "title": "Philip Meyer Award Presentation",
        "type": "Special Event",
        "description": "The presentation of the 2016 Philip Meyer Journalism Awards will take place on Friday at the 2017 CAR Conference in Jacksonville. The awards recognize the best uses of social research methods in journalism and are named in honor of Philip Meyer, author of “Precision Journalism” and retired Knight Chair in Journalism and UNC School of Journalism and Mass Communications.\n\nThree awards are given annually — a first, second and third place — to recognize the best work using techniques that are part of precision journalism, computer-assisted reporting and social science research. The awards are: $500 for first, $300 for second, and $200 for third.\n\nFor information on the 2016 Award winners, click here.",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "18:00",
        "time_end": "18:15",
        "length_in_hours": 0.25,
        "room": "Conference Center A&B",
        "event_id": "2702/2993",
        "event_url": "https://ire.org/events-and-training/event/2702/2993/"
    },
    {
        "title": "Philip Meyer Award Reception & David Donald Remembrance",
        "type": "Reception",
        "description": "Join fellow CAR attendees in celebrating the Philip Meyer Award Winners at a reception Friday night with light hor d'oeuvres and a cash bar beginning at 6:15 p.m. in River Terrace 1.\n\nJoin us for a brief tribute to former IRE training director and Philip Meyer Award winner David Donald, who died in December.",
        "speakers": "TBA",
        "date": "2017-03-03",
        "time_start": "18:15",
        "time_end": "19:30",
        "length_in_hours": 1.25,
        "room": "River Terrace 1",
        "event_id": "2702/2994",
        "event_url": "https://ire.org/events-and-training/event/2702/2994/"
    },
    {
        "title": "Conference registration (Saturday)",
        "type": "Special Event",
        "description": "Registration will be located on the 3rd floor Skybridge of the Hyatt Regency Jacksonville Riverfront.",
        "speakers": "TBA",
        "date": "2017-03-04",
        "time_start": "08:30",
        "time_end": "18:00",
        "length_in_hours": 9.5,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3002",
        "event_url": "https://ire.org/events-and-training/event/2702/3002/"
    },
    {
        "title": "Conference sales (Saturday)",
        "type": "Special Event",
        "description": "Stop by the NICAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the NICAR T-shirt contest.",
        "speakers": "TBA",
        "date": "2017-03-04",
        "time_start": "08:30",
        "time_end": "18:00",
        "length_in_hours": 9.5,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3006",
        "event_url": "https://ire.org/events-and-training/event/2702/3006/"
    },
    {
        "title": "Advanced analysis in SQL",
        "type": "Hands-on",
        "description": "If you feel comfortable with the Structured Query Language basics that IRE teaches in its boot camps -- SELECT, FROM, WHERE, GROUP BY -- but are ready to see what else SQL can do, this session is for you. We will cover more advanced ways of manipulating and questioning data, such as UPDATE queries, joins, writing sub-queries, and other neat tricks.  We will use SQLite.",
        "speakers": "Meghan Hoyer",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2956",
        "event_url": "https://ire.org/events-and-training/event/2702/2956/"
    },
    {
        "title": "Breaking through the Facebook wall: Reporting on Facebook using components of Facebook",
        "type": "Panel",
        "description": "",
        "speakers": "Jeremy Merrill, Julia Angwin, Jon Keegan",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/2916",
        "event_url": "https://ire.org/events-and-training/event/2702/2916/"
    },
    {
        "title": "Conversations: Let's chat journalism and technology fellowships! Bring your questions and ideas (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "If you've ever thought about applying for a journalism-tech fellowship, join us to chat about the application process. Learn about applying to the Knight-Mozilla Fellowship or the BuzzFeed Open Lab, or just talk through what makes a fellowship application strong.",
        "speakers": "Amanda Hickman, Erika Owens",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2984",
        "event_url": "https://ire.org/events-and-training/event/2702/2984/"
    },
    {
        "title": "Drawing for a better brain",
        "type": "Demo",
        "description": "Can learning to draw improve your writing and reporting skills?  Can you, a reporter good with words who can only draw a stick figure, learn to draw?  Yes you can!  To prove it, come take this hour-long drawing lesson from a Time Magazine reporter/writer turned professional artist and art teacher.  You'll walk away with a finished drawing, and a newfound understanding of how exercising the right side of your brain will help you in your professional life.  All materials provided, no drawing experience necessary.",
        "speakers": "Leah Kohlenberg",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3115",
        "event_url": "https://ire.org/events-and-training/event/2702/3115/"
    },
    {
        "title": "Extracting data from PDFs (repeat session)",
        "type": "Hands-on",
        "description": "Learn how to use tools for extracting text from documents. The seminar will discuss the fundamentals of knowing the best tool for the job, a walk-through using online web applications, and an introduction to cracking tough cases using Optical Character Recognition (OCR). For questions before or after the course, please email Acton Gorton (actongorton@gmail.com).",
        "speakers": "Miguel Barbosa",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/2954",
        "event_url": "https://ire.org/events-and-training/event/2702/2954/"
    },
    {
        "title": "Geocoding addresses",
        "type": "Hands-on",
        "description": "If you've had to place many addresses on a map before, you know how problematic bulk geocoding can be -- technical issues, terms of service, fun, fun fun! If you've never had the pleasure, don't worry, we'll show you how to happily (and correctly) geocode large sets of addresses.",
        "speakers": "Michael Corey",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3079",
        "event_url": "https://ire.org/events-and-training/event/2702/3079/"
    },
    {
        "title": "Intro to database manager MySQL I",
        "type": "Hands-on",
        "description": "We’ll show you how to import files into MySQL, a powerful open-source database manager. You’ll use SQL to sort, query and add new fields to make sense of the data.\n\nThis session is good for: Anyone with basic spreadsheet or database skills.",
        "speakers": "Ronald Campbell",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2957",
        "event_url": "https://ire.org/events-and-training/event/2702/2957/"
    },
    {
        "title": "Marrying documents and data",
        "type": "Panel",
        "description": "",
        "speakers": "Steven Rich, Brooke Williams, Francisco Vara-Orta, Tom McGinty",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3137",
        "event_url": "https://ire.org/events-and-training/event/2702/3137/"
    },
    {
        "title": "Simple ways to create immersive news stories",
        "type": "Panel",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3008",
        "event_url": "https://ire.org/events-and-training/event/2702/3008/"
    },
    {
        "title": "Stats: An introduction",
        "type": "Hands-on",
        "description": "You know how to do sums and averages in Excel. What's next? Learn how to use other statistical tools in Excel, from standard deviations to correlations to t-tests.",
        "speakers": "Holly Hacker",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/2955",
        "event_url": "https://ire.org/events-and-training/event/2702/2955/"
    },
    {
        "title": "Under pressure: Real life in real time with breaking news",
        "type": "Hands-on",
        "description": "",
        "speakers": "Noah Pransky, Nicole Vap",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/3068",
        "event_url": "https://ire.org/events-and-training/event/2702/3068/"
    },
    {
        "title": "Securing data and communications",
        "type": "Panel",
        "description": "Are your sources’ identities at risk? Are you handling sensitive information? Do you need to protect your data from digital espionage? Do you need to encrypt your communication with editors and sources? Are you under technical attack? In two hours, your information security skills will go to the next level. Use a digital security toolbox and learn how to store, send and receive sensitive information. Bring your computers and mobile phones, and enjoy a cryptoparty at NICAR 2017!",
        "speakers": "Jorge Luis Sierra",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "11:15",
        "length_in_hours": 2.25,
        "room": "River Terrace 1",
        "event_id": "2702/2917",
        "event_url": "https://ire.org/events-and-training/event/2702/2917/"
    },
    {
        "title": "Intro to R (intermediate) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Add statistical heft to your reporting by using R, a free, powerful open-source programming language. By the end of this two-hour session, you will be able to take raw data, import it into R, and start your analysis. Topics will include basic data importing, working with directories, reading in data, installing packages, creating simple visualizations, and how to clean, explore and sort your data. We'll also talk about how to find help when you're stuck.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: This session will be most helpful if you’re comfortable working with data and you’re ready to take your skills to the next level.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "Charles Minshew",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "City Terrace 9",
        "event_id": "2702/2886",
        "event_url": "https://ire.org/events-and-training/event/2702/2886/"
    },
    {
        "title": "Build your first news app (intermediate) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "This mini-boot camp will walk you through the process of building a simple online news application from a dataset. You will get hands-on experience in every stage of the development process, writing Python, HTML and JavaScript using version control tools. You won't stop until you've deployed a working application onto the World Wide Web.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: If you have a good attitude and know how to take a few code crashes in stride, you are qualified for this class.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "Armand Emamdjomeh, Ben Welsh",
        "date": "2017-03-04",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "City Terrace 4",
        "event_id": "2702/2885",
        "event_url": "https://ire.org/events-and-training/event/2702/2885/"
    },
    {
        "title": "A roundup of international CAR",
        "type": "Panel",
        "description": "How is data journalism done in Norway - in Costa Rica - or in Cameroon? What are the trends and stories done outside of the US? See what journalists around the world are doing - and maybe you can steal a story idea or two to take home.\n\n**Moderated by Helena Bengtsson, The Guardian",
        "speakers": "Marianne Bouchart, Rigoberto Carvajal, Helena Bengtsson",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3116",
        "event_url": "https://ire.org/events-and-training/event/2702/3116/"
    },
    {
        "title": "Advanced PDF manipulation (repeat session)",
        "type": "Hands-on",
        "description": "So now you know how to get data from basic pdfs and large batches. What about mixed formats, ongoing jobs etc?\n\nThis session will cover how to process pdfs in large batches, use Amazon Mechanical Turk, schedule OCR jobs to work while you aren't around, and build data pipeline. If you’re comfortable with the command line and Tesseract this is for you.",
        "speakers": "Jacob Fenton",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3080",
        "event_url": "https://ire.org/events-and-training/event/2702/3080/"
    },
    {
        "title": "Behind the scenes: Electionland",
        "type": "Panel",
        "description": "",
        "speakers": "John Keefe, Scott Klein, Olivia Ma",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/2918",
        "event_url": "https://ire.org/events-and-training/event/2702/2918/"
    },
    {
        "title": "Conversations: Feeling defeated? You're not the only one (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "Regardless of your views on the new administration, the campaign and election made it easy to feel like the work we do isn't important or impactful. I don't have answers, but maybe others do, and some constructive emoting might provide some catharsis either way.",
        "speakers": "Alan Palazzolo",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2985",
        "event_url": "https://ire.org/events-and-training/event/2702/2985/"
    },
    {
        "title": "Data cleaning in SQL",
        "type": "Hands-on",
        "description": "Spend enough time around databases and inevitably you’ll come across one that has an obnoxious number of variations on city names: New York City. New York. NYC. NY. And yes, even NY City. If you’re not sure how to handle that, this session is for you. Come to “Data cleaning in SQL” if you’ve had an introduction to SQL but want to move past the basics of “WHERE” and “ORDER BY.” We’ll cover how to deal with multiple spellings and misspellings, strange date formats, category codes, and a few other tricks and tips for using SQL to clean data.",
        "speakers": "Madi Alexander",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/3082",
        "event_url": "https://ire.org/events-and-training/event/2702/3082/"
    },
    {
        "title": "Drones for mapping",
        "type": "Demo",
        "description": "You've seen breathtaking video from drones, but the same platform can be used for mapping small areas at very high resolutions. The software couldn't be easier to make high resolution georeferenced aerial photos for data journalism. In this demo, you'll see the hardware, software and techniques used to do drone mapping.",
        "speakers": "Matt Waite",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3023",
        "event_url": "https://ire.org/events-and-training/event/2702/3023/"
    },
    {
        "title": "Intro to database manager MySQL II",
        "type": "Hands-on",
        "description": "We'll pick up from 'Intro to database manager MySQL I' and continue to cover SQL, introduce joining tables, and talk about some of the useful functions and other features unique to MySQL that make it a powerful and useful tool for reporting.\n\nThis session is good for: Anyone with basic spreadsheet or database skills; we suggest you take the first part of this class: Intro to database manager MySQL I.",
        "speakers": "Liz Lucas",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/2961",
        "event_url": "https://ire.org/events-and-training/event/2702/2961/"
    },
    {
        "title": "Mining data from the social web (hands-on)",
        "type": "Hands-on",
        "description": "From President Donald Trump’s Twitter account to fake news — social media platforms have become a major source for news.\n\nThis hands-on session will give journalists the ability to harvest information from the social web in structured and automated ways. Participants will learn how to collect information from Facebook pages and Twitter accounts via scraping and APIs and turn them into spreadsheets.\n\nTo get the most out of this session: Attendees should have a basic grasp of programming concepts but do not need to be proficient in coding. Attendees should have their own Twitter and Facebook accounts and create app IDs for API access in advance of the session.",
        "speakers": "Cathy Deng, Lam Thuy Vo",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/2958",
        "event_url": "https://ire.org/events-and-training/event/2702/2958/"
    },
    {
        "title": "Public finance and the EMMA website",
        "type": "Hands-on",
        "description": "For reporters covering state or local government, the Electronic Municipal Market Access (EMMA®) website provides free access to detailed information about the financial health of states, cities and counties, as well as many hospitals, universities, stadiums and other ventures financed by public debt. Staff from the Municipal Securities Rulemaking Board will demonstrate how to find data and information on EMMA, from public finance credit ratings to comprehensive annual financial reports. This interactive session will also highlight several EMMA tools and resources that can assist reporters with monitoring state and local finances and identify potential stories.",
        "speakers": "Leah Szarek",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/2953",
        "event_url": "https://ire.org/events-and-training/event/2702/2953/"
    },
    {
        "title": "Stats: Linear regression",
        "type": "Hands-on",
        "description": "Go beyond counting and sorting. Learn how (and when) to measure relationships, level playing fields and make predictions.",
        "speakers": "Jeff Kelly Lowenstein",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/2960",
        "event_url": "https://ire.org/events-and-training/event/2702/2960/"
    },
    {
        "title": "The art and science of the data story comment request",
        "type": "Panel",
        "description": "So you’ve spent months analyzing data and collecting documents for an investigation and now it’s time to get a comment from the subject of your story. Except, they don’t like the story and don’t want to cooperate. How do you maximize your chances of getting a meaningful response? What does a well-crafted comment request look like? And what should you expect – and not expect – when you request comment for your story? Come hear answers to these and other questions as well as tips and tricks for managing your next big comment request.",
        "speakers": "Rob Barry, Cezary Podkul, Sarah Ryley",
        "date": "2017-03-04",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3010",
        "event_url": "https://ire.org/events-and-training/event/2702/3010/"
    },
    {
        "title": "Carwash: Data cleaning in Excel",
        "type": "Hands-on",
        "description": "",
        "speakers": "Mike Wilkinson",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 10",
        "event_id": "2702/2964",
        "event_url": "https://ire.org/events-and-training/event/2702/2964/"
    },
    {
        "title": "Command line tools for reporters (PC)",
        "type": "Hands-on",
        "description": "Repetitive tasks are the worst. I think we can all agree. If you’re tired of monotonous copying and pasting, if large files are harshing your mellow, or even if you just want to know more about that screen from War Games, then this class is for you. We’ll walk through some basics of the command line that can make your life easier and free up time for more important things. We’ll explore the powerful and versatile csvkit, fix messed up pdfs with some simple commands and get a taste of automating file downloads. No coding experience required but familiarity with SQL is a plus. Class is for PC users, but we’ll talk about Linux and Unix as well.",
        "speakers": "Chad Day",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 11",
        "event_id": "2702/3121",
        "event_url": "https://ire.org/events-and-training/event/2702/3121/"
    },
    {
        "title": "Conversations: How do I exist and work in a newsroom as a POC? (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "I'm interested if any journalists have brought up these issues in their own newsroom with their co-workers and/or management. It doesn't have to be along the lines of race, but also sexuality, immigration, gender, religion etc. The title refers to the question that I often asked myself after the election and subsequent current events.\n\nIf it has been brought up in other newsrooms, did the discussion include newsroom ethic handbooks, defining conflicts of interest, and dealing with having a perceived advocacy/agenda as a news org while also fighting 'fake news.'",
        "speakers": "Helga Salinas",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2986",
        "event_url": "https://ire.org/events-and-training/event/2702/2986/"
    },
    {
        "title": "Design track: Use a charting tool (Sponsored by Society for News Design)",
        "type": "Hands-on",
        "description": "We’ll take a look at Datawrapper and discuss how to use it, how to customize it for your newsroom styles, and more.",
        "speakers": "Grace Donnelly, Stacy Jones",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3055",
        "event_url": "https://ire.org/events-and-training/event/2702/3055/"
    },
    {
        "title": "Digging through the web",
        "type": "Panel",
        "description": "\"Digging through the web\" is being presented by Gary Price, founder of infoDOCKET.com and Caryn Baird, News Researcher at the Tampa Bay Times. In a fast-paced session, two veteran librarians will share a variety of research techniques and free resources. From backgrounding a person to retrieving an archived multimedia interview to one-click web scraping, this session will give you tools you can put to use immediately.",
        "speakers": "Caryn Baird, Gary Price",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3131",
        "event_url": "https://ire.org/events-and-training/event/2702/3131/"
    },
    {
        "title": "Going long on middleform",
        "type": "Panel",
        "description": "We've all heard of longform journalism — it's been the model for visual storytelling ever since “Snowfall” came out in 2012. Recently, our newsrooms have been producing more and more \"middleform\" — spending a week or two on visual and graphic stories instead of a month or more. We'll give some examples of recent middleform work, talk about the challenges of this kind of storytelling, and talk about where we see the format going in the next few years.\n\n**Moderated by Tom Cardoso, The Globe and Mail",
        "speakers": "Darla Cameron, Sarah Frostenson, Maureen Linke, Stuart Thompson, Tom Cardoso",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/2920",
        "event_url": "https://ire.org/events-and-training/event/2702/2920/"
    },
    {
        "title": "Investigating bias and influence in criminal justice: Police and prosecutors",
        "type": "Panel",
        "description": "From wrongfully recording racial profiling data in traffic ticketing to disparities in adult diversion programs run by prosecutors, this session will examine how to mine criminal justice data, what to do when there seems to be no data and reporting it all out.\n\n**Moderated by Cheryl W. Thompson, The Washington Post",
        "speakers": "Sharad Goel, Josh Hinkle, Andrew Lehren, Cheryl W. Thompson",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3021",
        "event_url": "https://ire.org/events-and-training/event/2702/3021/"
    },
    {
        "title": "Negotiating for the records",
        "type": "Panel",
        "description": "",
        "speakers": "Maggie Mulvihill, John Bones, Jim Ross",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3141",
        "event_url": "https://ire.org/events-and-training/event/2702/3141/"
    },
    {
        "title": "Personalized interactive journeys",
        "type": "Demo",
        "description": "This session explores the developing art of creating mobile-friendly news interactives that deliver personalized experiences to users by guiding them through a series of choices. Scott Blumenthal, deputy editor of interactive news at the New York Times and Sandeep Junnarkar, director of interactive journalism at the CUNY Graduate School of Journalism, will explain the process of building these interactives that show audiences where they fit into the news – helping them understand complex issues or make informed decisions. The panelists will showcase work they've produced and explain how the pieces came together. This engaging form of storytelling can help the user forge connections to the experiences of others – giving them a deeper, more visceral understanding of the news’ impact on people’s lives.",
        "speakers": "Scott Blumenthal, Sandeep Junnarkar",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3117",
        "event_url": "https://ire.org/events-and-training/event/2702/3117/"
    },
    {
        "title": "Security tools for journalists - hands on (repeat session)",
        "type": "Hands-on",
        "description": "You're traveling abroad to cover a story: What steps can you take to secure your data, your devices, and your sources before heading to the airport? What are the pros and cons of bringing a burner into the field? How should you send notes to your editor before returning home? This hands-on workshop is designed to address the digital security needs of journalists as they travel overseas. Participants can expect to demo a number of software solutions and security practices — with particular focus paid to mobile and desktop security and file encryption.",
        "speakers": "Mike Tigas",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/3069",
        "event_url": "https://ire.org/events-and-training/event/2702/3069/"
    },
    {
        "title": "Stats: Logistic regression",
        "type": "Hands-on",
        "description": "Linear regression helps you find relationships between two or more variables, but when an outcome has only two possibilities, you need a different tool. That, my friends, is where logistic regression comes in.\n\nThis session will be taught in PSPP and will be most useful if: You took 'Stats: An introduction', or are comfortable with summary statistics and PSPP or SPSS. Familiarity with spreadsheets and database managers is recommended.",
        "speakers": "Jennifer LaFleur",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/2963",
        "event_url": "https://ire.org/events-and-training/event/2702/2963/"
    },
    {
        "title": "Visualization and analysis in Python (repeat session)",
        "type": "Hands-on",
        "description": "So you're familiar with Python and some of its core concepts. How do you use that to crunch large amounts of data and records into stories and data visualizations quickly and easily? In this hands-on course, we'll show you our tips and tricks in using our favorite Python tools to do just that. You’ll walk out knowing how to go from analysis to publishable graphics in just a few minutes. The tools we'll be using: Seaborn (statistical data viz library), matplotlib (plotting library), pandas (data analysis tool), and Jupyter notebooks.",
        "speakers": "Chase Davis",
        "date": "2017-03-04",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3098",
        "event_url": "https://ire.org/events-and-training/event/2702/3098/"
    },
    {
        "title": "Lunch on your own (Saturday)",
        "type": "Outside Event",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-04",
        "time_start": "12:30",
        "time_end": "14:15",
        "length_in_hours": 1.75,
        "room": "See printed schedule for room information",
        "event_id": "2702/2998",
        "event_url": "https://ire.org/events-and-training/event/2702/2998/"
    },
    {
        "title": "Conversations: Open Slot! Signup at the Conversations room (Sponsored by SRCCON - OpenNews)",
        "type": "Special Event",
        "description": "",
        "speakers": "TBA",
        "date": "2017-03-04",
        "time_start": "12:45",
        "time_end": "13:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2987",
        "event_url": "https://ire.org/events-and-training/event/2702/2987/"
    },
    {
        "title": "Media lawyers brown bag",
        "type": "Special Event",
        "description": "",
        "speakers": "Madeleine Baran, Michael Corey, William Craft",
        "date": "2017-03-04",
        "time_start": "12:45",
        "time_end": "13:45",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3145",
        "event_url": "https://ire.org/events-and-training/event/2702/3145/"
    },
    {
        "title": "30/60: Thirty of the best free data storytelling tools in sixty mins",
        "type": "Demo",
        "description": "Settle in and buckle up! News innovators-in-residence Mike Reilley a trainer with the SPJ/Google News Lab program and Victor Hernandez from Banjo crank up the gravity-defying mind-bending roller coaster of new digital tools -- 30 of the latest and greatest (and free) for your data reporting toolkits. Featuring hands-on training focused on the newest available data visualization methods, mapping tools, mobile newsgathering apps and more -- this adventure promises all of the excitement of your favorite thrill ride, sans the motion sickness.",
        "speakers": "Victor Hernandez, Mike Reilley",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2922",
        "event_url": "https://ire.org/events-and-training/event/2702/2922/"
    },
    {
        "title": "Advanced Django for data analysis",
        "type": "Hands-on",
        "description": "",
        "speakers": "Adam Playford",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3122",
        "event_url": "https://ire.org/events-and-training/event/2702/3122/"
    },
    {
        "title": "Building your first Leaflet.js map",
        "type": "Hands-on",
        "description": "Maps! Who doesn't love wonderful, colorful maps? In this course we will be building a map with Leaflet.js., a very popular Javascript mapping library. The map will display both markers and shapes. The shapes will be used to create a basic choropleth map.",
        "speakers": "Chris Essig",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/2966",
        "event_url": "https://ire.org/events-and-training/event/2702/2966/"
    },
    {
        "title": "Data can only dance with its music: Understanding the ecology of public data",
        "type": "Panel",
        "description": "Traditionally, journalists have sought government documents. Today we seek digital data. But that data always exists in a metadata ecosystem of variable definitions. The metadata contributes to seeing patterns, trends and significance in the data analysis. So do we submit FOIA requests for the data or the metadata or both in the same request? Each approach can have varying degrees of success. This session will consist of short presentations, followed by an audience discussion of how to develop best practice FOIA request strategies.",
        "speakers": "Carli Brosseau, Tom Johnson, Andrew Lehren",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/2921",
        "event_url": "https://ire.org/events-and-training/event/2702/2921/"
    },
    {
        "title": "Getting started with Access without using SQL",
        "type": "Hands-on",
        "description": "This session is designed to teach you how to use Access without Structure Query Language, also known as SQL. Learn how to download data onto Access and query the data using design view or the grid, instead of SQL. You’ll learn how to select specific fields on the data, sort and filter.",
        "speakers": "Mc Nelly Torres",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3084",
        "event_url": "https://ire.org/events-and-training/event/2702/3084/"
    },
    {
        "title": "Inaugural hack swap",
        "type": "Special Event",
        "description": "",
        "speakers": "Jeremy Bowers, Andrew Chavez, Jon McClure",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2988",
        "event_url": "https://ire.org/events-and-training/event/2702/2988/"
    },
    {
        "title": "Investigating bias and influence in criminal justice: Judges and beyond",
        "type": "Panel",
        "description": "**Moderated by Cheryl Phillips, Stanford University",
        "speakers": "Cheryl Phillips, Michael Braga, Robert Gebeloff, Barnaby Skinner",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/2926",
        "event_url": "https://ire.org/events-and-training/event/2702/2926/"
    },
    {
        "title": "Using R as a GIS for spatial analysis and visualization (advanced)",
        "type": "Hands-on",
        "description": "In this session, we'll be using R for spatial analysis and creating publication-worthy map graphics. Learn how to go beyond the dots to dig deeper and tell better stories with location data in bulk.",
        "speakers": "Andrew Tran",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/3083",
        "event_url": "https://ire.org/events-and-training/event/2702/3083/"
    },
    {
        "title": "What product can do for journalism",
        "type": "Panel",
        "description": "Media companies, both startups, and legacy organizations are investing in news products, such as mobile apps, email newsletters, SMS bots, etc. The product approach, which demands design, data, technology, journalism, and management skills, is critical to the future of media and can lead to new revenue streams and rewarding new career paths.",
        "speakers": "Marie Gilot, Celeste LeCompte, Stacy-Marie Ishmael",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3035",
        "event_url": "https://ire.org/events-and-training/event/2702/3035/"
    },
    {
        "title": "Working with academics",
        "type": "Panel",
        "description": "Academics can help you make almost impossible projects possible. But how do you know when a project would be a good fit for academic collaboration? What's the challenges behind it? And how do you thread the needle between the demands of journalism and the restrictions of academia? Hear from three journalists with experience in these types of projects. Find out how to take your complicated idea and turn it into reality without tearing your hair out.",
        "speakers": "Matt Dempsey, Karisa King, Al Shaw",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3048",
        "event_url": "https://ire.org/events-and-training/event/2702/3048/"
    },
    {
        "title": "Visualizing and understanding uncertainty (Sponsored by Society for News Design) **pre-registered attendees only",
        "type": "Hands-on",
        "description": "Statistics is the science of uncertainty. It’s an invaluable tool for journalists trying to help readers and viewers make good choices with imperfect data. But though our models come with uncertainty, we are sometimes bad at helping readers understand the uncertainty that’s built into our work. Science is not far ahead of us -- look at the uncertainty cone in a hurricane, which lay readers often mistake for hurricane size. Look at how readers misinterpreted election predictions, even when they came with confidence intervals or likelihood measurements. How can we explain uncertainty better so that readers understand it? This is designed to be a hands-on collaborative workshop in which science communicators and visual journalists discuss the state of the art in visualizing uncertainty, then come up with some new directions via sketching and prototyping.\n\nPreregistration is required and seating is limited. Computers will not be provided for this workshop so please bring your laptop.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "Alberto Cairo, Jen Christiansen, Mark Hansen",
        "date": "2017-03-04",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "City Terrace 7",
        "event_id": "2702/3054",
        "event_url": "https://ire.org/events-and-training/event/2702/3054/"
    },
    {
        "title": "Command line for reporters (Unix)",
        "type": "Hands-on",
        "description": "Too often in data journalism we forget about the basics. And it doesn’t get as basic as the command line.\n\nEven knowing a little will make your job easier. We’ll run through some simple commands, and dive into working with spreadsheets, I’ll show you some handy tools I frequently use at work.\n\nThis session is good for: People unfamiliar with the command line, and those who want to get some practical, hands-on practice with the Mac-based terminal.",
        "speakers": "AJ Vicens",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3065",
        "event_url": "https://ire.org/events-and-training/event/2702/3065/"
    },
    {
        "title": "Counting & summing with Access without using SQL",
        "type": "Hands-on",
        "description": "You know how to use Excel, but what do you do when you have a huge database with dozens of columns full of data? Access lets you isolate those different columns and efficiently sort through the stuff you don’t need, letting you quickly analyze national databases to figure out which convenience store sold the most winning Powerball tickets, which county has the highest number of infant deaths within a certain time frame, or which state has the most historical wooden bridges more than 100 years old that, say, go over railroad tracks.\n\nThis class is for anyone trying to find the golden nugget hiding in the data. No programming language or SQL experience necessary, but a healthy understanding of Excel is helpful.",
        "speakers": "Tisha Thompson",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3085",
        "event_url": "https://ire.org/events-and-training/event/2702/3085/"
    },
    {
        "title": "Earth, wind and fire: Covering disasters from a data perspective",
        "type": "Panel",
        "description": "When disaster strikes, it can turn a newsroom into chaos. Tight deadlines, power loss and harried editors all complicate the already rough waters of navigating a newsroom as a data journalist. This panel will prepare you to weather the storm.  Panelists will discuss what you need, where to get it and how to rise above the inevitable firestorm that besets a newsroom when the Earth turns the news cycle upside-down. We'll also talk about new ways of presenting those stories through satellite imagery and weather data.",
        "speakers": "Eric Sagara, Stephen Stirling, Chris Vaillancourt",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/2923",
        "event_url": "https://ire.org/events-and-training/event/2702/2923/"
    },
    {
        "title": "Google Fusion Tables (beginner)",
        "type": "Hands-on",
        "description": "Welcome to Google Fusion Tables. In this hands-on introduction to the free online tool you'll learn how to import and combine data, do simple analysis and easily turn that into an online map.\n\nThis session will be most useful if: You've ever used a spreadsheet. You need to have a Google account.",
        "speakers": "Tommy Kaas",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/2973",
        "event_url": "https://ire.org/events-and-training/event/2702/2973/"
    },
    {
        "title": "Javascript charts and maps, straight from R (intermediate)",
        "type": "Hands-on",
        "description": "In this session, we'll be using htmlwidgets to create simple JavaScript charts and maps, straight from your R data analysis pipeline and with no need to write JavaScript",
        "speakers": "Peter Aldhous",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/2968",
        "event_url": "https://ire.org/events-and-training/event/2702/2968/"
    },
    {
        "title": "Localize that investigation: Using AP data to do your own stories",
        "type": "Special Event",
        "description": "",
        "speakers": "Troy Thibodeaux, Meghan Hoyer, Ian Greenleigh",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/2989",
        "event_url": "https://ire.org/events-and-training/event/2702/2989/"
    },
    {
        "title": "Protecting endangered data in the Trump era and beyond",
        "type": "Panel",
        "description": "Access to government data has always hinged on the priorities and values of different administrations. We’ll talk to attendees about how they can protect endangered data in the Trump era and beyond. Panelists will share lessons learned and best practices from their own experiences shielding data.\n\n**Moderated by David Herzog, IRE/NICAR",
        "speakers": "Margaret Janz, David Herzog, Yogin Kothari, Nancy Watzman",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3125",
        "event_url": "https://ire.org/events-and-training/event/2702/3125/"
    },
    {
        "title": "Quick-turn data stories",
        "type": "Panel",
        "description": "",
        "speakers": "Greta Kaul, Dave Sheingold, Patrick Cain, Mark Walker",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3043",
        "event_url": "https://ire.org/events-and-training/event/2702/3043/"
    },
    {
        "title": "Self-promotion for the data reporter",
        "type": "Panel",
        "description": "Do you struggle to get data projects off the ground because your editor won't give you time? Do you wish you could learn jQuery but keep getting stuck on daily projects? Two battle-tested editors and a freelancer are ready to share their wisdom on how to find gigs, story space, funding or other opportunities to help you be the data reporter you know you can be.",
        "speakers": "Scott Klein, Samantha Sunne, Chrys Wu",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/3037",
        "event_url": "https://ire.org/events-and-training/event/2702/3037/"
    },
    {
        "title": "Tools to convert lots of PDFs at once",
        "type": "Demo",
        "description": "This class will cover basic approaches for getting text out of PDF documents using powerful and freely available tools. Participants will be introduced to basic concepts and walked-through tackling common challenges encountered with tricky PDF documents.\n\nThis class is best for: People who are unfamiliar with the PDF to text tools or would like to learn how optical character recognition (OCR) tools can be used for extracting difficult text from images embedded in PDF documents.",
        "speakers": "Todd Wallack, Miguel Barbosa",
        "date": "2017-03-04",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2924",
        "event_url": "https://ire.org/events-and-training/event/2702/2924/"
    },
    {
        "title": "Advanced analysis in SQL (repeat session)",
        "type": "Hands-on",
        "description": "If you feel comfortable with the Structured Query Language basics that IRE teaches in its boot camps -- SELECT, FROM, WHERE, GROUP BY -- but are ready to see what else SQL can do, this session is for you. We will cover more advanced ways of manipulating and questioning data, such as UPDATE queries, joins, writing sub-queries, and other neat tricks.  We will use PostgreSQL.",
        "speakers": "Chris Schnaars",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/3087",
        "event_url": "https://ire.org/events-and-training/event/2702/3087/"
    },
    {
        "title": "Animated videos",
        "type": "Hands-on",
        "description": "Short animated videos are a great way to  tell complex stories in an easily shareable form that works on most devices and social media platforms. In this session, learn to create and publish your own animated video from scratch with Adobe After Effects.\n\nThis session is good for beginners who are new to making videos as well as for people with some experience in video production looking to add animation to your skill set. This workshop also introduces the basics of Adobe Expressions, a javascript like language, to control animation.",
        "speakers": "Kavya Sukumar",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/2969",
        "event_url": "https://ire.org/events-and-training/event/2702/2969/"
    },
    {
        "title": "Economic development incentives: Old issues, hot new data",
        "type": "Panel",
        "description": "States and cities spend tens of billions of dollars on “corporate welfare,” or economic development tax breaks for all kinds of projects. Persistent shoe-leather reporting has long proven effective in exposing problems with many deals. Now a new accounting rule, Governmental Accounting Standards Board Statement No. 77 on Tax Abatement Disclosures, is about to generate first-ever spending data from more than 50,000 local and state bodies of government, a new investigative gold mine!",
        "speakers": "Janelle O'Dea, Greg LeRoy",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Conference Center B",
        "event_id": "2702/3138",
        "event_url": "https://ire.org/events-and-training/event/2702/3138/"
    },
    {
        "title": "Ethical dilemmas in data",
        "type": "Special Event",
        "description": "",
        "speakers": "MaryJo Webster, Tom McGinty",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 12",
        "event_id": "2702/3139",
        "event_url": "https://ire.org/events-and-training/event/2702/3139/"
    },
    {
        "title": "Internet Archive: Resources, tools, and tricks",
        "type": "Demo",
        "description": "Have you ever wondered how to get the Wayback Machine to crawl what you want it to crawl? Are you looking for that thing you know President Donald Trump said, but you don’t remember when, where, or to whom? Would you like to know how often a particular video clip was repeated by Fox News or MSNBC? We’ll do a deep dive into the byways of the Internet Archive and explore how we can help bolster your reporting. We’ll also preview our plans to mine more rich metadata from our 30 petabytes of TV news shows, web pages, books and more.",
        "speakers": "Nancy Watzman",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/2927",
        "event_url": "https://ire.org/events-and-training/event/2702/2927/"
    },
    {
        "title": "Joining in Access without using SQL",
        "type": "Hands-on",
        "description": "Learn how to join tables and match information from one file to another.\n\nIf you feel at home with Excel, but want to take the next step with larger files and joining data, this is the session for you. Access is the easy gateway drug to the harder stuff, like SQL and R - and here you'll learn how to join and count without a single line of code.\"",
        "speakers": "Helena Bengtsson",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 6",
        "event_id": "2702/3088",
        "event_url": "https://ire.org/events-and-training/event/2702/3088/"
    },
    {
        "title": "Putting your town under a microscope--and keeping it there",
        "type": "Panel",
        "description": "",
        "speakers": "Kate Howard, Matt Kiefer, Andrew Mollica",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3143",
        "event_url": "https://ire.org/events-and-training/event/2702/3143/"
    },
    {
        "title": "Regular expressions",
        "type": "Hands-on",
        "description": "Regular expressions are a powerful tool when working with data, especially when dealing with values that are formatted inconsistently. They're supported by a variety of text editors, databases and programming languages, but they can be pretty daunting if you've never dealt with them before. Learn about the basics of regular expressions and how they can help with your next batch of dirty data.",
        "speakers": "Justin Myers",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3086",
        "event_url": "https://ire.org/events-and-training/event/2702/3086/"
    },
    {
        "title": "Separating fact from fiction: Information verification",
        "type": "Panel",
        "description": "Odds are, your boss has asked you to comb through social media during breaking news to find photos and witness accounts. Odds are, no one has taught you how to assess whether those images are authentic. We will.",
        "speakers": "Steve Myers, Gary Price",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Conference Center A",
        "event_id": "2702/2925",
        "event_url": "https://ire.org/events-and-training/event/2702/2925/"
    },
    {
        "title": "Using data to cover immigration",
        "type": "Panel",
        "description": "",
        "speakers": "Nassos Stylianou, Linnea Heppling, Andrew Becker",
        "date": "2017-03-04",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/3142",
        "event_url": "https://ire.org/events-and-training/event/2702/3142/"
    },
    {
        "title": "Command line graphics",
        "type": "Demo",
        "description": "Some of the most powerful tools for creating visuals and working with images lie hidden in your terminal. We'll do an overview of some of these amazing (FREE!) tools – such as ImageMagick and ffmpeg – and see some real-world techniques for working with large collections of images, and how I use these tools in my projects. Some of the things we'll cover: make a timelapse video from sequential images, extract and save metadata embedded in photos, create image quilts, and build animated GIFs from videos.",
        "speakers": "Jon Keegan",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3119",
        "event_url": "https://ire.org/events-and-training/event/2702/3119/"
    },
    {
        "title": "Finding connections in campaign finance data with graph databases",
        "type": "Hands-on",
        "description": "Graph databases are optimized for working with complex and connected data. Campaign finance data is a great example of a complex dataset where the connections in the data are often as important as the discrete data points, making it a great use case for a graph database.\n\nIn this hands-on workshop we will cover how to model, import, and query campaign finance data using the Neo4j graph database. We will focus on learning the property graph data model and how to use Cypher, the query language for graphs, to write queries that can help find stories in the data.\n\nThis session is geared toward those with some basic familiarity with databases and data analysis, but will start at an introductory level for those new to graph databases.",
        "speakers": "Meredith Broussard, William Lyon",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3066",
        "event_url": "https://ire.org/events-and-training/event/2702/3066/"
    },
    {
        "title": "Getting data into Excel",
        "type": "Hands-on",
        "description": "Data doesn’t always come in nicely formatted spreadsheets. For some file formats, you can’t analyze the data until you get it into a spreadsheet. In this session, we will import everything from text files to tables on a webpage into Excel. We will cover the importance of data types, delimiters and fixed-width columns to make the import process as smooth as possible.",
        "speakers": "Emmanuel Martinez",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/3072",
        "event_url": "https://ire.org/events-and-training/event/2702/3072/"
    },
    {
        "title": "Lighter side of data journalism?",
        "type": "Panel",
        "description": "Pokemon Go analysis, Halloween Candy Index, March Madness Nailbiter Bot…there is room for playful data journalism in the newsroom. Join us as we walk through lighthearted projects - from data acquisition to presentation. Bring your ideas and we can workshop them as well.",
        "speakers": "Jenny Ye, Jeffrey Hargarten",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3130",
        "event_url": "https://ire.org/events-and-training/event/2702/3130/"
    },
    {
        "title": "Stats: Linear regression (repeat session)",
        "type": "Hands-on",
        "description": "Go beyond counting and sorting. Learn how (and when) to measure relationships, level playing fields and make predictions.",
        "speakers": "Jeff Kelly Lowenstein",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3094",
        "event_url": "https://ire.org/events-and-training/event/2702/3094/"
    },
    {
        "title": "Twitter tricks and analytics",
        "type": "Hands-on",
        "description": "Dive deeper with Twitter through advanced searches, including tweets near a specific location. Explore third-party apps to mine Twitter for sources and visuals. Learn the basics of analytics to determine which tweets connect with your audience and which ones fall flat.",
        "speakers": "Doug Haddix",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "City Terrace 7",
        "event_id": "2702/3070",
        "event_url": "https://ire.org/events-and-training/event/2702/3070/"
    },
    {
        "title": "Year in CAR (repeat session)",
        "type": "Panel",
        "description": "What were the big stories of the year? What were the most creative uses of data analysis? See what your colleagues have been up to and pick up some story ideas at the same time. This session is good for: Anyone.",
        "speakers": "Lauren Grandestaff, Kaitlin Washburn",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2928",
        "event_url": "https://ire.org/events-and-training/event/2702/2928/"
    },
    {
        "title": "Conference sales (Sunday)",
        "type": "Special Event",
        "description": "Stop by the NICAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the NICAR T-shirt contest.",
        "speakers": "TBA",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "10:30",
        "length_in_hours": 1.5,
        "room": "3rd floor - Skybridge",
        "event_id": "2702/3007",
        "event_url": "https://ire.org/events-and-training/event/2702/3007/"
    },
    {
        "title": "Just enough Django: Distributed data entry in the newsroom (beginner/intermediate) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Dana Amihere, Ken Schwencke and Ben Welsh present a step-by-step guide to creating a simple web application that empowers you to enlist reporters in data entry and refinement. The 3-hour, hands-on tutorial will teach you how to take advantage of the Django Web framework's powerful administration panel, without bothering with all the other web developer crap. You will learn how to design database tables, load in data and quickly create a system for others to improve its content.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: If you have a good attitude and know how to take a few code crashes in stride, you are qualified for this class.\n\nNOTE: Registration is required for this session. Click here to sign up.",
        "speakers": "Dana Amihere, Ben Welsh",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "City Terrace 4",
        "event_id": "2702/2884",
        "event_url": "https://ire.org/events-and-training/event/2702/2884/"
    },
    {
        "title": "OpenElections hackathon",
        "type": "Special Event",
        "description": "",
        "speakers": "Derek Willis, Serdar Tumgoren",
        "date": "2017-03-05",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "City Terrace 12",
        "event_id": "2702/2990",
        "event_url": "https://ire.org/events-and-training/event/2702/2990/"
    },
    {
        "title": "ArcGIS Online and the power of Story Maps",
        "type": "Hands-on",
        "description": "",
        "speakers": "Cooper Thomas, Chris Vaillancourt",
        "date": "2017-03-05",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/3092",
        "event_url": "https://ire.org/events-and-training/event/2702/3092/"
    },
    {
        "title": "Career roundtable",
        "type": "Panel",
        "description": "Looking for advice on how to take the next step in your career? Get practical tips from panelists who will talk about their own experiences and discuss what employers are looking for.\n\n**Moderated by Megan Luther, IRE/NICAR",
        "speakers": "Jill Riepenhoff, Steven Rich, Megan Luther, Clark Fouraker, Mc Nelly Torres",
        "date": "2017-03-05",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3044",
        "event_url": "https://ire.org/events-and-training/event/2702/3044/"
    },
    {
        "title": "Data analysis in Javascript and Node.js",
        "type": "Hands-on",
        "description": "",
        "speakers": "Daniel Lathrop",
        "date": "2017-03-05",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3067",
        "event_url": "https://ire.org/events-and-training/event/2702/3067/"
    },
    {
        "title": "Let's get creepy: Backgrounding tips from a journalist and librarian",
        "type": "Panel",
        "description": "Backgrounding sources can be a tedious and time-consuming process. But there's nothing worse that being caught off-guard in the moments before publication – or, even worse, after publication. We'll help you develop a list of go-to online tools and resources to speed up the process, and run through a couple scenarios to show you how they work in practice.",
        "speakers": "Sarah Hutchins, Lauren Grandestaff",
        "date": "2017-03-05",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2929",
        "event_url": "https://ire.org/events-and-training/event/2702/2929/"
    },
    {
        "title": "Programming best practices",
        "type": "Demo",
        "description": "We've all created projects that grew bugs and corner cases like they were going out of style. I've certainly created many projects that turned into unruly messes of dependency hell, and hard to follow logic. But it doesn't have to be that way. In this class we'll cover hard earned lessons in structuring code, handling and processing data, and general organization best practices, that will help you find the best story from your data, while saving your sanity.",
        "speakers": "Jeff Larson",
        "date": "2017-03-05",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3120",
        "event_url": "https://ire.org/events-and-training/event/2702/3120/"
    },
    {
        "title": "Stats: Logistic regression (repeat session)",
        "type": "Hands-on",
        "description": "Linear regression helps you find relationships between two or more variables, but when an outcome has only two possibilities, you need a different tool. That, my friends, is where logistic regression comes in.\n\nThis session will be taught in PSPP and will be most useful if: You took 'Stats: An introduction', or are comfortable with summary statistics and PSPP or SPSS. Familiarity with spreadsheets and database managers is recommended.",
        "speakers": "John Perry",
        "date": "2017-03-05",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/3095",
        "event_url": "https://ire.org/events-and-training/event/2702/3095/"
    },
    {
        "title": "D3: How to make reusable charts for different platforms",
        "type": "Hands-on",
        "description": "We'll learn how to start coding D3 in a simple way, setting our code so that we can power charts ready to be used on mobile, desktop, social media and video. The session will focus also on how to set Excel files to include special features in a D3 chart, examples and useful GitHub libraries to use.\n\nThis class is good for: basic and intermediate learners of D3, HTML and CSS.",
        "speakers": "Daniele Palumbo",
        "date": "2017-03-05",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 5",
        "event_id": "2702/3140",
        "event_url": "https://ire.org/events-and-training/event/2702/3140/"
    },
    {
        "title": "Getting data into Access",
        "type": "Hands-on",
        "description": "This course will review the basics of using Microsoft Access. Understanding when Access is the right database software to use, how to enter and import data, and what to look for once you’re staring at a database interface.",
        "speakers": "Tracy Greer",
        "date": "2017-03-05",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 9",
        "event_id": "2702/3071",
        "event_url": "https://ire.org/events-and-training/event/2702/3071/"
    },
    {
        "title": "Google Fusion Tables (advanced)",
        "type": "Hands-on",
        "description": "",
        "speakers": "Daniel Lathrop",
        "date": "2017-03-05",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "City Terrace 8",
        "event_id": "2702/2970",
        "event_url": "https://ire.org/events-and-training/event/2702/2970/"
    },
    {
        "title": "Introducing Flourish: A powerful new platform for templating visuals and stories",
        "type": "Demo",
        "description": "Flourish is a new platform for data visualization and storytelling. It enables journalists to easily produce and publish high-end graphics, maps, explainers, steppers and other outputs from flexible templates. An ever-growing library of open-source templates is available, but developers can also make their own public or private templates using the Flourish SDK and standard technologies such as D3, SVG and WebGL. Flourish was created by multi-award-winning visualization studio Kiln; beta partners include the BBC, Guardian and FT. This event gives an overview of the platform and provides NICAR attendees with exclusive early access to the website and SDK.",
        "speakers": "Duncan Clark,",
        "date": "2017-03-05",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 2",
        "event_id": "2702/3093",
        "event_url": "https://ire.org/events-and-training/event/2702/3093/"
    },
    {
        "title": "Outwit, outplay, outlast: How to pull off a student investigation",
        "type": "Panel",
        "description": "Think you don't have the time or resources to pull off a data-driven or investigative story as a student? We'll prove you wrong. We'll be sharing our favorite tips, techniques and tools for student journalists. Learn how to outwit campus administrators, outplay FOIA exemptions and outlast sources who expect you to go away quietly after graduation.\n\n**Moderated by Sarah Hutchins, IRE/NICAR",
        "speakers": "Briana Erickson, Sara Gregory, Samantha Sunne, Sarah Hutchins",
        "date": "2017-03-05",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 3",
        "event_id": "2702/3126",
        "event_url": "https://ire.org/events-and-training/event/2702/3126/"
    },
    {
        "title": "Social media sleuthing",
        "type": "Panel",
        "description": "Discover the tactics and tricks of advanced searches in Facebook, LinkedIn, Twitter and Instagram. Tap the power of geolocation to find public social media posts by location, including near a specific address anywhere in the world. Learn how to monitor social platforms efficiently.",
        "speakers": "Doug Haddix",
        "date": "2017-03-05",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "River Terrace 1",
        "event_id": "2702/2930",
        "event_url": "https://ire.org/events-and-training/event/2702/2930/"
    }
]